[["what tv series cancellation broke your heart because you never got to see the end?", "HBO's Rome. They had so much more story to tell."], ["what film role was 100% perfectly cast?", "I scrolled awhile and didn’t see it so Sir Ian McKellen gets my vote for his role as Gandalf. He played him so perfectly down to the tiniest of details. His facial expressions are unmatched imo"], ["what is the best answer when your girlfriend asks if her friend is hot?", "“Not as hot as your sister”"], ["who do you think has legitimately lost their mind?", "Connor Mcgregor, shell of his former self"], ["people who get told they look younger than they are: what is your secret?", "my mom uses a parasol in strong sunlight. people look at her weird, but parasols were a thing in many societies. she's got the skin of a woman half her age."], ["if you could have anything removed from your body, what would it be?", "Stomach fat. I just can't seem to lose it."], ["what’s the one unsolved mystery/crime you’d like to see solved before you leave this earth?", "Where Susan Powell's body is. I want her parents to be able to bury her with her babies. We all know what happened, Josh murdered her. She deserves better in life. But now that she's gone, she deserves to be with her children and her family deserves to be able to visit her grave."], ["what's the best way to subtly fuck with someone?", "It was only a few weeks, but a supervisor on a construction site I worked on was complaining about the birds in front of his office. That night I went to a pet shop and bought a big bag of birdseed. I hid it nearby, and when the coast was clear I would scatter a couple of handfuls. It took a few days, but more & more birds started stopping by to look for food. Had over 30 pigeons out there one morning when he came in. I let him in on what I was doing one day when he’d pretty much given up and was throwing old bread out for the birds. \n\nHe later asked me to pick up another bag of seed, as he’d taken over throwing out seed and ran out."], ["what is the dumbest lie you've ever heard of?", "I used to volunteer at a primary school to get credits for university. One of the kids had pica, he’d eat everything if it wasn’t too big, and one day his entire desk just collapsed in front of us. Teacher took him outside and asked if he had eaten the screws holding it together and he said no, but he did see a burglar come in during break time and steal them. Idk that was pretty stupid I guess."], ["who will be the last one on your mind when you leave this world?", "My first daughter. Unfortunately, she passed away at the age of 5 due to a heart defect."], ["what’s something you didn’t realize was expensive until you became an adult?", "Food, thought it was cheap."], ["what foods are meant to make your body healthier, but are actually making things worse?", "Granola bars that are actually just candy bars"], ["what's something you gave up on that surprisingly made your life better?", "I gave up trying to control everything, and it brought more peace."], ["which movie would u like to forget so that u can watch it again?", "The gladiator 1, since I then can sweat out of my eyes at the ending again..\n\nBesides that also since a second one is releasing the end of this year (i'm so hyped!)"], ["what is your age and how's life at that age?", "71 and I’m not okay with this. Waved my son and his family off this morning after an amazing two week holiday that just zoomed by. Made me sad to see them go. Even the dog is depressed!"], ["what's something that wont exist in 10 years?", "Videos that you can just.. believe."], ["what’s a small, everyday annoyance that you wish you could get rid of forever?", "That thing where I go to “click” something on my phone, and *the instant* before my finger hits the screen, it changes to something else."], ["what's the dark side of falling in love?", "Falling for the wrong person. It's happens more often than people realize."], ["what's that one thing you're better than 99.9% of people at?", "Relevant to my career. But I'm a absolute master of putting o-rings in extremely difficult to put locations.\n\nCo-workers would spend hours and then I'd just go by and bam, one handed and didn't even need a o-ring pick.\n\nDunno why. It's incredibly niche but it's not even remotely close. \n\nI'm an o-ring installation god."], ["what is denied by everyone but actually 100% real?", "A lot of psychological stuff in here, but I just wanted to mention that driving barefoot is legal in every state in the united states. Lots of people doubt me when I mention it."], ["what are you starting to dislike more and more as you get older?", "People. I really don't enjoy them anymore. Is it age? Most people I know feel the same since Covid19. I just love being at home and socialising is such an effort now"], ["redditors, if you could travel back in time to a certain point of your life, what year and why?", "I'd go back to 2010 to relive simpler times before everything got complicated."], ["reddit, if you could have one superpower what would it be?", "Omnipotence.\n\nOtherwise, time control."], ["what show are you binge watching right now?", "Buffy the Vampire Slayer"], ["you won $5m. what’s the first thing you buy?", "Lunch. Any big purchase would probably take too much time to be the first buy."], ["what was the worst financial decision of your life ?", "\"Lending\" money to \"friends\" who \"promise to pay me back.\""], ["what does everyone like and you never understand why they like it?", "Why people are obsessed with reality TV. I just don’t get the appeal of watching staged drama and manufactured conflict for hours."], ["when will commercial space travel ever be as affordable for normal people?", "Not in your lifetime."], ["what are you really good at doing but it doesn’t make any money?", "Not talking. I hate talking I love silence"], ["what is a song we all should listen once in life?", "[Ode To Joy](https://www.bing.com/videos/riverview/relatedvideo?q=ode%20to%20joy%20youtube&mid=8733C4844908468DAAEA8733C4844908468DAAEA&ajaxhist=0)\n\nActually the whole symphony, if you have the time."], ["what is your comfort tv show?", "Futurama. \n\nThere have been years where that show was how I went to bed."], ["what’s the best line from a movie?", "\"Hey guys. Ooo big gulps huh? Alright well, see ya later.\""], ["what is the best thing about this world and why?", "Dogs. Do I even need to explain why?"], ["who is the least controversial musician you can think of?", "Was gonna say Dave Matthews but that damn bridge incident.... haha"], ["what would you say to person who is thinking about going no contact with parents who abused them whole childhood & teenage ?", "I'd give them applause."], ["what's a overused excuse that still works?", "\"I'm sorry, I got caught up with work\" still tends to be effective."], ["what discontinued product do you miss?", "I am getting pitch forked for this, but I actually miss going out to blockbuster and renting a video. The whole going out, browsing the library, anticipation made it much more fun. I sometimes miss that."], ["people who are 40+, what would you change if you were 30 again?", "Get in shape, your body/skin  changes rapidly in your 40’s  and doesn’t tighten up the same."], ["what’s the last thing you would want to die doing?", "I’d want to die doing something meaningful and fulfilling."], ["what was your most rewatched movie as a kid?", "Jurassic park and the mummy"], ["what’s a skill you think everyone should learn, and why?", "swimming at least to the level you can not drown in calm water"], ["what is the common/popular food that everyone likes but you don't?", "I had to scroll a while before finding a comment I agreed with."], ["redditors, what will you do if suddenly all smart phones disappeared?", "Go outside in a happier world"], ["what piece of advice or phrase has helped you most change your life?", "Happiness is a choice"], ["if your pet could suddenly talk and reveal everything it's seen, what would you be most worried about?", "I’d be most worried about discovering how often they’ve been anxious or uncomfortable."], ["what would you like to do at least once in your life ?", "A month long road trip out west (USA). Visit national parks & major cities."], ["what film are you most sad about never being made?", "Sad is too strong a word, but did genuinely want to watch Coyote vs. Acme, that was canned for tax reasons. Premise sounded fun, and it apparently scored very well with test audiences. Guy who cancelled it didn't even watch it."], ["how can you describe \"love\" by your own experience?", "Love feels like a complex, profound connection that goes beyond mere attraction or infatuation. It’s a blend of comfort, excitement, and a deep sense of belonging. When you love someone, you may find yourself prioritizing their happiness and well-being alongside or sometimes above your own. It’s often about acceptance and appreciation, embracing both the strengths and flaws of the person you care about."], ["if you could go back in time and say just one thing to your 5 years old self what would it be?", "Invest to bitcoin no matter what."], ["what is the worst interaction you've ever had with a stranger?", "As a kid, I was in an elevator and an older woman steps in. \n\nIt was very quiet until she started singing in an Irish accent “in the morning as I started, I scratched me arse and farted”\n\nThen she didn’t say another word.."], ["how do you handle the death of a pet?", "Grieve. It takes time."], ["what is a skill that humanity has lost over the centuries that would completely transform our world if it were rediscovered today?", "The lost art of sustainable living."], ["what is your million dollar idea?", "A subscription service for curated DIY home improvement kits with everything you need for each project. It combines convenience with creativity, appealing to busy people who want to upgrade their space without the hassle."], ["what sounded to you like a good opportunity but turn out to be a scam that most people aren’t aware of?", "I have experience in marketing. A lot of nondescript “marketing and sales” jobs on indeed are scam companies, basically looking for people to do telesales, they want to pay by commission.\n\nI once went to a joint interview for once, they asked “what is the total population of the UK?” And I was the only one there who knew the answer. I’M BRITISH. Shit was crazy. "], ["what is your favorite monster/creature from any folklore, a story, or anything like that?", "Pantalaimon from His Dark Materials, and the whole concept of daemons in general."], ["who is the most badass male movie protagonist of all time?", "Not many more bad ass than John Wick."], ["what's a good selling point for being single forever?", "I do what I want, when I want. If I don't want to do it, I don't do it. \n\nWith great power comes great responsibility."], ["what are some places that have been ruined by over-tourism?", "Paris, the Eiffel Tower isn’t pretty, it’s full of fences and restaurants and gift shops etc"], ["what are the three greatest decisions of your life?", "Money, Marriage, Kids   in that order"], ["what movies had a great trailer but turned out to be a flop?", "If you want to talk financial flop, Scott Pilgrim vs the World comes to mind. It was such a bizarre trailer that had me sold. Movie bombed hard at the box office. My local theater played it for a single week."], ["what’s the most impactful thing someone has ever said to you in just a few words?", "“You shouldn’t have the mentality of everyone has to lose so I can win, everyone can win, all together.”"], ["what’s your most prized possession?", "You know years ago my house had a gas leak and I had to run out of the house.. I was hardly dressed, no phone, nothing except my dog in my arms 😅\n\nHe's passed now and I can't think of anything I'd want to grab.. maybe my necklace my mom gave me 🤔"], ["if you became a god overnight, what would be the first thing you'd do?", "Fixing some of the world’s biggest issues like poverty and climate change. It would be amazing to use that power to create a better future for everyone."], ["what is the most pointless subject you have taken in college/uni?", "Everything that wasn't directly related to my major. Stupid core curriculum."], ["why do you think people ask relationship advice on to randoms on reddit?", "Some relationship questions are embarrassing so it’s easier to ask random strangers that we will never meet."], ["what’s a weird life hack that seems completely useless but has saved your life multiple times?", "Pausing a second before proceeding on the green light."], ["if you could be any disney character forever, who would it be?", "Goofy. The guy is a responsible and loving dad, and tries his hardest for his son"], ["what’s something that you wish people really understood about you?", "That we have different struggles in life. And the littlest and kindest act we can share to everyone is at least be compassionate."], ["what used to be a big thing but suddenly wasn't anymore?", "a family living well off 1 income"], ["what not-scary movie terrified you as a kid?", "The Witches by Roald Dahl, because the images of witches and the scary plot left a strong impression on me when I was young"], ["whats the weirdest historical event?", "The Battle of Los Angeles\n\nhttps://en.m.wikipedia.org/wiki/Battle_of_Los_Angeles"], ["whats something that instantly angers you?", "Youtube recommending vids that are part of a series, but it's always part 2+, never part one\n\nOr you know genocide or child abuse or whatever"], ["what celebrity do you wish would take a break from the spotlight?", "Dwayne Johnson and Kevin Hart need to shut the fack up for a while."], ["what's the weirdest/ most messed up dreams you've had?", "Last night’s dream was weird.  I needed to use the restroom in a public place, the problem was that there was no lock on the door, and it was exposed to some kind of play area.  I was waiting on it shutting, (it was closing time), but these two mothers were yakking with their kids running around.  I asked them to move along but was told to shut up, then I told them to ‘fuck off’.  They stormed off and I did my business.  \n\nWhen I got to the managers office they were complaining, not listening just shouting.  So I punched on in the face and she went down.  \n\nGot home, and there was police waiting to arrest me with some document listing the woman and her solicitor.  Hired a hit man to take out the woman, then killed the hit man, and buried his body.  Case went away, kinda woke up at this point."], ["what’s your favorite martial arts movie?", "TMNT 2 - Secret of the Ooze"], ["what has happened to you that made you question if you were going crazy?", "I once mistook turbulence for flirting signals from the universe... turns out, it was just a bumpy flight, not my love life taking off."], ["what phrase did you hear a long ago, that's still with you to these days?", "\"This too shall pass.\""], ["how do you know you’ve “made it” in life?", "When I can go to the grocery store and check out without even noticing the amount."], ["what are some of the upsides of being unattractive?", "i know the people who keep me around genuinely enjoy my company."], ["what's a hard pill to swallow?", "Realizing that not everyone you care about will reciprocate the same level of effort or commitment is a tough one. It’s a hard truth but an important lesson"], ["what was the most embarrassing moment on live tv?", "[Fallen officer gets called deedee mega doodoo](https://youtu.be/9Hu-HfpKi84?si=k1aiC2awKITLpbS9), has to be the worst"], ["what was the best investment you ever made?", "\n\nMight not be considered an investment, but I quit drinking 2,261 days ago and the returns on that are seemingly limitless"], ["humans, how would you feel about a law that bans every beeping/buzzing/alarm type of noise on radio?", "Honking horns and sirens too."], ["is asking someone their nationality considered rude where you’re from? if so, why?", "No, as long as it’s not in a “Where are you REALLY from?” sort of way"], ["what movie could you not watch again?", "Grave of the Fireflies beautiful but heartbreaking."], ["what does everyone think it is a compliment but actually it isn't?", "Well bless your heart!"], ["what are some working weight gain tips for people with high metabolism?", "Your \"metabolism\" is not the problem. If you want to gain weight you need to consume more calories.\n\nYour stomach needs to expand because you're accustomed to eating the amount you do now. You'll have to push yourself to eat beyond your full level, but not to the point that you want to puke it all up.\n\nAdditionally, you need to be eating good, nutritious food, otherwise you're just putting yourself on track for heart disease and/or diabetes. Good weight gaining food to eat would be proteins like white meats, red meats in moderation, unsaturated fats like nuts and whole grains, balanced with natural carbs like whole wheat pasta and bread, rice, etc. Throw some greens in there so you get some fiber because protein turns your poop to rocks.\n\nExercise will ensure that the weight you gain goes to building muscle. If you gain weight and don't exercise, you just gain fat, and that's not necessarily better than being skinny. As you exercise, your appetite will increase."], ["what is the most silly thing that you thought of or remembered that caused you to wake up from  sleeping?", "Waking up next to my ex"], ["if you started a company, what would the name be and what would you do?", "“Kama sutra Kings” or “KSK” for short, gigalo service."], ["what \"dangerous\" country would you love to visit one day?", "Ukraine\n\nI wanna visit Chernobyl"], ["what are the potential disadvantages of being single?", "Being single can sometimes mean dealing with loneliness, handling all responsibilities alone, and facing social pressure about relationships. Financially, it can also be a bit tougher, as you’re covering costs by yourself"], ["what is the coolest mushroom?", "psilocybin mushrooms 🍄"], ["reddit, who the heck works minimum wage jobs in super expensive towns? and where do they live?", "Young people who live with their parents, immigrant workers sharing a tiny flat with four-five other immigrants, people who commute from less expensive towns, people with a partner who earns more, there may be various government schemes allowing people and families to welfare while they work."], ["what tv show suffered from the worst seasonal rot?", "Seems to me like it's \"The Walking Dead\". Everyone I ask says it went downhill after season 4. It used to be the biggest show on television."], ["why can’t dogs, or any other animal learn to speak human language?", "That’s why I have a bird 🦜"], ["what is the biggest lie you’ve ever told someone?", "\"She is just a friend relax.\"\n\n-three months later catches them in the act in a run down hotel room-"], ["if you could relive one day of your life, which day would you choose and why?", "Any day that my dad was still alive and not sick for.\n\nThe why is because I miss him."], ["what would you do if you were your neighbor?", "Both of us will be wondering if one or the other is a clone or the original."], ["what is your favorite all-round state in the usa?", "Massachusetts. Beaches, skiing, cities, mountains, history, Islands, farms, witches, sports etc. I’m not saying it’s better than other states but it really does have something for everyone"], ["what is your biggest pet peeve?", "People with no awareness of what's going on around them. Like people at the grocery store that just stand in the middle of an aisle and they're so slow to move, even when you say \"excuse me\"."], ["what's something which makes you instantly happy :d ?", "Heathy and sincere interactions in fandoms. As they are sort of rare. In the sense that a lot of people are really \"cold and professional\" about it or straight up or sort of shitty. Just in general it's sort of hard to find a solid connection. As a lot of people just want to put all their chips on their friend group and not as much into fan communities."], ["what might be the long-term effects if people could communicate directly with their future selves?", "It would make taking advantage of someone for personal gain very difficult"], ["what emoji would you use forever?", "I love this one : 🤦‍♀️"], ["whats your favourite thing to do?", "I love reading books and playing with my cat."], ["what is  that one thing that you will never mess with?", "Garage door springs. Shit will fuck your day up."], ["what movie scene always makes you cry?", "\"Where are his glasses!? He can't see without his glasses!\" and every elder millennial tries holding back tears."], ["whats the most annoying thing?", "Toss up between people who drive too slow in front of me and people behind me who want to go faster."], ["what's something that you really enjoy that other people can't seem to understand?", "I listen to [instrumentals](https://youtu.be/UcVdBJ3WD1M?si=ZK3Q6d30fWWyd5sc) a lot, even at work. Coworkers will be like, \"Where are the words?!\" Lol.\n\nHelps me zone out everything else and just focus on my tasks."], ["what is the best docuseries you've ever watched?", "Probably about 10-13 years ago, it was on North Korea. Heartbreaking really, to see how starved they were. The president of KIA sent 100 milking cows (I want to say Gurnsey or Jerseys) across the border as a sign of good faith to help their struggling \"cousins\". Knowing how the country is run, I doubt the people who needed it the most were able to benefit."], ["men, what has someone done that you thought was flirting but apparently wasn't?", "Sit in front of me with her legs opened up (in tights). "], ["what is something you wish you had learned earlier in life?", "I wished I learned earlier on how to manage finances and somehow have an investment plan for my future.\n\nThis is better done while young because it gets more  expensive as you age."], ["what was the last thing that made you smile?", "last year my Birthday"], ["how accurately is your occupation depicted in fiction? what would you change?", "I'm a health care worker! Most accurate is definitely Scrubs. As far as what I'd change in my careers depiction is that tv shows show physicians doing everything that other staff like nurses, lab technicians, transporters do instead of those that actually do it."], ["what does your partner do that brings you great comfort?", "Honestly makes the best food :)"], ["what is your \"truth is stranger than fiction\" story?", "One time, a friend’s dog managed to get into a locked room and ate an entire cake meant for a big family celebration. The twist? The dog was on a diet and had never shown any interest in sweets before. It was like something out of a sitcom—complete with a family meeting to figure out how the cake disappeared and a guilty-looking dog with frosting on its face."], ["people who have been in long-term relationships: how do you feel about being single?", "Not a fan. Newly single for the first time in almost 10 years. I’m sure that will change over time. The loneliness is tough."], ["what makes you get up in the morning in a happy mood?", "Knowing I have a fresh cup of coffee waiting and the chance to tackle new opportunities always puts me in a happy mood first thing in the morning!"], ["looking at your past, if you could have done something differently, what would it be and why?", "I would have asked to visit my grandparents more often."], ["what films do you consider a cult film from the last decade?", "The House that Jack Built"], ["what is your biggest fear as a child that you still have today?", "fear of losing loved ones."], ["if you could only pick one personality trait that is most important to you in a significant other, what would it be?", "I’d say a good sense of humor is the most important trait for me. Life can be pretty unpredictable, and having someone who can laugh through the ups and downs makes everything a lot more enjoyable. Plus, it’s a bonus if they can appreciate my really terrible puns!"], ["what are some healthy kitchen and food habits everyone should know about ?", "Clean a pan with a little paper towel before washing it."], ["if you could end one evil in the world, what would it be?", "Periods I feel like women shouldn’t suffer"], ["what is your favorite country you traveled too?", "Toss up between Norway & New Zealand."], ["what was super popular when you were younger and kids nowadays won't understand?", "Leaving the house and your parents having really no idea where you went to or any way to contact you. Then you just came home when the street lights came on for dinner."], ["what did you used to hate but came around to, even now love?", "Squirrels.  They're like creepy little aggressive rats to me.  Always chasing one another. \n\nWell, I have a telephone pole and a bunch of trees where I live, which I can see from my couch. \n\nI gotta give it up to them squirrels.  They're kinda like little monkeys. Do some pretty amazing acts.  Impressive."], ["what’s the best country you have travelled to in europe? anything you suggest doing/ eating/ drinking?", "I'd say the Netherlands\n\nI've found the Dutch are a great laugh, very welcoming, they love their sport and often speak better English than us English \n\nI especially love Amsterdam \n\nThe best thing for me is, lots of people visit for lots of reasons but everyone just gets on with it. It may to go to the great Steakhouses, religious sites, pubs, weed bars or sex shows (or maybe all?). But it's just so laid back and everyone just gets on with their own thing\n\nScheveningen and the Hague are brilliant too"], ["which film would’ve been a lot more enjoyable if the actors in two roles were swapped?", "Nicolas cage and John travolta in face off…..oh wait……"], ["if you could re-name earth what would you name it?", "I’d sell the naming rights to the highest bidder. I hope y’all like living on Pepsi Planet"], ["what experience are you glad you never have to live through again?", "Bone marrow biopsy. Unless I do."], ["what’s the most unexpected thing that ever happened to you during a routine day?", "Got hit by lightning on the radome,,,nose of my md80 jet shooting an approach to Chicago ohare airport at 3000 feet. Full airplane 140 people all got the thrill or scare of their lives. Thunderstorms all around. I was the captain flying with a major airline.  Just another day in the office. . Landed uneventful,, but forgot to make a PA because we were so close to Landing. Flight attendants said everyone just about crapped in their pants. Very loud bang. Should have seen the flash right in front of me."], ["what’s the compliment you’ve received that you still remember?", "is it just me that thinks the \"you smell nice\" compliment beats everything"], ["where is the worst place to be in an earthquake?", "Glas jar storage warehouse."], ["what to do when someone is talking shit about you?", "Nothing, and just ignore it. I'm pretty important to them for them to want to talk shit about me. I realized I'm the center of their miserable universe."], ["what should be the punishment for tourists defacing historical sites?", "Get kicked out of the country no questions asked"], ["what have you been saying you would do, but it's already been a year and you still haven't?", "diet and start exercising"], ["what country would you visit right now if you had the money?", "Australia. I live there but it’s huge and can be prohibitively expensive to travel around it."], ["what’s a fantasy that you think about often but haven’t shared with anyone?", "A plastic sheet, a gallon of Wesson oil, and a nude Margot Robbie"], ["which video game you played in your childhood which has special place in your heart ?", "We didn't have video games.  We had a black-and-white TV.  We could watch American Bandstand!"], ["what is a movie you love, that other people would find mediocre or boring?", "Wonderland is a movie I quite like. The movie may be described as procedural and run-of-the-mill, but it has some great performances and an atmosphere I really enjoy."], ["what's your most disgusting being sick story?", "Got food poisoning one time and things kept coming from both ends all night long"], ["what the hell are you going to do with your saturday?", "Eat junk food and play la noire. It's my first weekend off in a while."], ["how do you make new friends?", "Join clubs or activities that interest you, be personable and open to new people, and don't be afraid to start discussions to meet new people."], ["who is happy to be alive, life another day ?", "Right now I feel pretty happy :D"], ["people who have done datura, how has it impacted you?", "i still hear her beautiful voice but she never existed"], ["what’s your first job and what job do you do now?", "My first job was working at a pool store. I’m now self employed selling things from home."], ["what did you want to be as a child?", "As a child, I wanted to be a magician. I imagined performing incredible tricks and making objects disappear with a wave of my wand."], ["who is not ok but is afraid to tell anyone in real life?", "Well that would open up a big can of worms..."], ["what are some things human urine is good for?", "Removing waste products from your body"], ["book readers with families, how do you manage reading ten plus books a year?", "Between 8pm and midnight are my free times, so it gives me some time to read a couple of pages. I've already read 5 books these last couple of weeks."], ["if you could replace your teeth with something else what would it be?", "Stainless steel teeth"], ["what is one regret you have in life ?", "Not living sooner. There’s a big difference between being alive and living."], ["where is the lead still lodged from your childhood pencil-stabbing?", "Palm, but it's graphite, not lead."], ["do you think there are more happy or unhappy people in this world, and why?", "Life isn’t generally happy.\n\nThe internet and television make you believe everyone else is happy.\n\nReality is usually pretty crappy. But occasionally you get those genuinely happy moments that become happy memories. That’s why people cherish it so much."], ["whats a small unexpected way you have improved your productivity or well being?", "Eating more fruits and vegetables. I know most of you will say “duhh” but it made a huge difference. It’s not just about the food. It changed my whole mentality and physical health within a week."], ["people who are unsuccessfully trying to sleep, what is keeping you awake?", "A 12 week old baby. So incredibly tired 😴"], ["what is your dream job??", "The one I have. I work back office for a bank. My schedule never changes, I don’t work with customers, no weekends, it can be feasible, no sales goals, and I have a supportive boss."], ["how do you make friends in the us?", "We ask a woman out, and she tells us \"I have a boyfriend, but we can be friends though.\" Problem solved."], ["people who have been divorced, what’s one piece of advice you’d give to someone about marriage?", "You don’t always have feel in love, but you should always respect each other. Conduct yourself in a way that deserves respect, and respect your partner when they deserve it (and even when they don’t)"], ["what hangover cure do you swear by?", "After I’ve had too much whiskey, I cook myself a large flank steak, pan-fried in salted butter. I eat that, put on a pair of wet socks and go to sleep\n\nOr just get back on it. Scales of the dragon that burned you"], ["which celebrities could or should play siblings?", "Tobey Maguire and Elijah Wood"], ["if necessity is the mother of invention, what do you think really needs to be invented?", "If teleportation became a thing, maybe I wouldn’t have to master the art of folding a week’s worth of outfits into a carry-on."], ["if a zombie apocalypse actually arises. what’s the first thing you’ll do?", "I was a mortician. As a frontline person i want you to know the shoelaces of the dead were tied together as a preemptive defense"], ["what’s the most realistic way someone who doesn’t come from money becomes wealthy?", "There's basically two ways that I've seen: \n\n1. Start a business that somehow manages to find its way into a very profitable niche. Take that business as far as they can, and then sell it. \n\n2. Get into a relatively high-paying professional career that allows them to actually build up some serious \"play money,\" and then, instead of blowing that money on lifestyle creep, make excellent and/or lucky investments."], ["your goal is to cause an argument. what do you say?", "\"Can you milk a dragon?\"\n\nThis has caused arguments at my local game store."], ["what skill is universally the most useful to learn?", "Critical and analytical thinking.\n\nYou apply it to everything in problem solving.  And life is basically a series of problems every day to solve."], ["if you could pick one person to come back to life, who would it be ?", "My grandmother and best friend from high school"], ["how do you deal with constant fear of failure?", "Accept that failure is normal — and it can be a good thing. \n\n\nAdopt a beginner's mind. \n\n\nTalk to someone you trust. \n\n\nGive yourself more options. \n\n\nRemember the cost of not trying. "], ["what is something you had to explain to a grown adult, you feel like you lost brain cells doing it?", "How credit cards can work in your favor"], ["what's one really messed up shit you have seen in real life?", "Back when I was a fireman, we responded to a house fire. It was fully involved when we got there. Homeowners were outside saying their daughter was still inside. We did what we could to knock it down enough to get a search crew in to look for her, even though we doubted she would still be alive. Search team goes in and reports zero visibility so they are doing what they can to search blind. One guy radios he is coming out and sounds shaken. A moment later he radios for someone to meet him at the door. A couple of us go to the door expecting he probably found the girl. We were right, but he didn’t have her with him. He was covered in blood and body bits and wanted to make sure the homeowners were not around to see him. He said he crawled into something squishy and thought it was wet laundry and tried to pick some up to confirm. What he found was he was holding bloody fleshy bits. The heat from the fire combined with the water we were dumping on it to knock it down quickly ended up steaming the girl’s body and our guy literally crawled thru her."], ["how is joe doing?", "Podcasts are like riding a bike."], ["which celebrities had you feeling utterly stunned when allegations surfaced against them?", "Mel Gibson. I grew up loving his movies. I knew he had been married a long time and had a lot of kids. Seemed like a total well-rounded family man when I was young. Then his tirades came out."], ["adult pro wrestling fans, why are you still a pro wrestling fan?", "The argument seems to be \"You're an adult, you should know it's fake and thus not like prowrestling.\"\n\nBreaking Bad is fake. Lord of the Rings is fake. It's Always Sunny in Philadelphia is fake. Since when does fake mean bad for television?"], ["hoarders, what will it take for you to get rid of your shit?", "Tons of therapy. It's a mental health issue."], ["which ingredient will instantly make you go \"nope\" no matter how tasty the food seems?", "Uncleaned animal stomach. People really eat that shit, its as terrible as it sounds. Like mowing the lawn and then keeping the grass for a few weeks in a pond before putting it in your food."], ["redditors, when you have a bad day what do you do you help?", "Jork it. and by it i mean my peanits"], ["what is the greatest instant ramen of all time?", "Nongshim hot and spicy , all day long"], ["what’s an everyday object that, if it suddenly disappeared, would completely change the way society functions?", "The transistor. It’s the tiny machine that makes all digital technology possible"], ["what is the best, yet lightest iphone?", "The imaginary one your friend pretends to call you back on!"], ["how did you become confident to start talking to people?", "Biggest thing was getting in really good shape fitness wise\n\nMakes a huge difference confidence wise"], ["what’s normal at 3pm but terrifying at 3am?", "Hearing children laugh"], ["does ai impact your life right now, and if yes - how?", "Yes.\n\nIm told to keep my AC at 80 degrees, while the local server farm is burning coal to produce a jpeg of a woman with five tits."], ["at what age did you find yourself most attractive?", "Let me tell you something, I haven't even begun to peak. And when I do peak, you'll know. Because I'm gonna peak so hard that everybody in Philadelphia's gonna feel it."], ["what’s the worst secondhand embarrassment you’ve had?", "watching that one breakdance on the olympics this year"], ["in your opinion what is the most beautiful eye color? why?", "In my opinion, the most beautiful eye color is green. Green eyes are rare and have a captivating, unique quality that seems almost magical."], ["if in the next 24 hours you had to choose between marrying the person you're seeing or cutting ties indefinitely, what would you do?", "Welp looks like I'm paying for a plane ticket I'm going on marrying"], ["what’s something you hate explaining to people in your line of work?", "That just because I am a woman does not make me inferior in my position. I don’t express or explain this out loud but more so think it and can’t stand it"], ["what’s the most valuable lesson you’ve learned from a failure?", "Failure is the first step towards success. Adversity is required in order to succeed."], ["what is a question you hate being asked?", "“Why are you so quiet?”"], ["what's the most misused english word?", "Loose. Why cant people differentiate between lose and loose"], ["what medical appointments should we do, and at what age should we start them?", "Get every vaccine, obviously"], ["what is the most evil thing you’ve ever done?", "The most evil thing I’ve done? Probably when I ‘accidentally’ ate the last cookie and then claimed it was a mystery. Haha!"], ["what’s something you’ve done that made you realize you’re getting older?", "Working out and still feeling it 4 days later. Also, gets drunk and have a hangover for 2 days lol"], ["what do you think the internet will be like in 10 years?", "I think there's going to be a lot less static content. More apps, and websites will integrate AI into their experience."], ["what’s your idea of a perfect weekend?", "Me and my family having movie marathon together and eat dinner with food I prepared for them."], ["for those who struggle with intrusive thoughts, how has your progress been after you've attended therapy?", "The therapist now intrudes my thoughts"], ["for those \"bad at relationships\", why?", "I know some people who are in a series of bad relationships, because of the choices they're making in selecting their partners. It's so obvious to everyone else, but it's hard to point it out to the person. \"Oh, the person who had a serious gambling addiction before you met them, has borrowed from you and can't return it. So sorry to hear that...\""], ["what do you think the greats (like tech innovators, olympians, well accomplished people,etc.) did to get where they are?", "Be born smarter and more canny than most other humans."], ["what would you do if you suddenly became extremely wealthy?", "High class prostitutes and a frightening amount of cocaine"], ["what’s the longest you ever slept and how did you do it?", "3 months but I was in a coma from a bear attack"], ["what is your comfort movie or series?", "Clannad and Eternal sunshine of the spotless\nmind"], ["what’s a simple pleasure in life that never fails to make you happy, no matter how many times you experience it?", "Taking off my socks after a long day."], ["is immortality a gift or a curse, and why?", "Is it immortality as in can *NOT* die, or immortality as in “as long as it’s not physically destroyed it could just keep living”?\n\nIf the former, curse, super-curse.  An immortal human, with our dinky little three-pound brains… is gonna get soooo bored.  You wouldn’t be infinitely capable… so what happens when the world ends for everyone else, and you’re just left there in the waste of it all?  Maybe that eventual meteor strike ejects you into space.  What if you get sucked into a sun (…eventually…), and after billions of years of blinding, boring white energy all around you, you end up in a black hole and then for eternity (however time works in there), you’re just in that thing, forever separated from anything meaningful ever again, smeared into part of the singularity yet somehow still alive and painfully, humanly, conscious of the absolutely never-ending march of time.  Eventually you become desperate for the universe to experience some sort of crunch or heat death or something, hoping against hope that something finally ends the nothingness that has become your perpetual existence."], ["to what extent could current science help stroke victims heal?", "Hello,\n\nSince March 2016 my father has had Aphasia and has been Hemiplegic due to medical negligence. Below is a link, he was perfectly healthy and it was just a complete tragedy. \n\n[https://www.abc.net.au/news/2024-05-29/queensland-health-medical-negligence-compensation/103710586](https://www.abc.net.au/news/2024-05-29/queensland-health-medical-negligence-compensation/103710586)\n\nI've always deeply believed that he could get his life back - and its been told to me from speech therapists and other medical professionals that he could. I've spent this time worried about telling others and kept our lives secretive out of fear that something bad might happen. But earlier this year we were approached by ABC and I just want the best possible life for my dad. \n\nFor years I've been wondering if there are modern technologies that could help him and us. If anyone knows anything on some level I would love for you to leave a comment.\n\nI'm his son now 23, I have troubles remembering the sound of his voice - and I am the only person that takes him out of his room. He is still totally aware and a delight to be around he just can't read, write, talk or walk. My dream is for him to be able to walk and talk again."], ["what are your recommendations for a movie/series?", "Schutter Island as a movie, Prison break for a serie!!!!!"], ["what toxic belief is far too common?", "Justifying bad behavior because someone did the same to you. Someone else acting poorly is not an excuse for you to act poorly."], ["why do you hate tiktok ?", "The AI voice sounds like she’ll grow up to be the worst kind of Karen."], ["what will social media talk about once the election is over?", "How much they hate the new president"], ["what author or book has the worst effect on humanity?", "The Bible.\n\nPeople have killed over it, fought over it & used it to subjugate others."], ["what’s something you wish you had realized earlier in life?", "imo, most people are too busy with their own lives to care about your mistakes. worrying less about what others think would’ve saved me a lot of stress."], ["any jobs that hire with no experience??no car no experience how does one start in life?", "I would suggest anything sales"], ["what if you could brig one mythological creature to life - how would the world adapt?", "Someone would probably kill it"], ["what is the most bizarre thing you have seen in a public place?", "Anything in downtown LA"], ["whats the spiciest thing you ever ate?", "I cried because of buldak ramen"], ["what’s a band or artist you used to love in high school but you now find they suck?", "Most pop music of my time: Backstreet Boys, N*Sync, basically most boy/girl bands with the exception of NKOTB"], ["what \"tv dad advice\" do you still remember and try to follow or instill in your own kids?", "Mine is \"caveat emptor\" that I learned from Brady Bunch dad Mike Brady. It means \"Let the buyer beware.\""], ["what has been people’s reaction, positive and negative, to those who wear obvious hearing aids at a younger age (college and 20-30s)?", "they are so lucky nowadays.  especially with the technology with implants, like cochlears and more, and getting better. \n \nBack in the day dude, these folks would just be in the deaf impaired community man. sucks. now they just living normal lives like anyone else like it aint no thing...so what about reaction?  \n\nwe take all these things for granted now."], ["you have 10 seconds of the world's full attention. what do you say to the people, and why ?", "Hello? Hello? Can everybody hear me? You can? Great, I just wanted to say tha"], ["living in senior apartment vs reg apt. how do they compare? did you move in as soon as you turned 55?", "I’ll tell you what, they’re marked a hell of a lot cheaper in my area. For a 2 bedroom senior, it’s 450-550. For a reg 1 bedroom, you’re starting at 1000."], ["what is something that almost everyone should do yet very few people actually know about/do it?", "Befriend themselves. Too few people get to know and understand themselves, are kind to themselves, forgive themselves, encourage and love themselves."], ["what is a thought in your mind that you never tell anyone?", "Most thoughts really. Random ass thoughts be popping into my head by no intent of my own. People would look at me weird if they saw my monologue lol"], ["what is the most devious thing(s) an ex has done to you?", "Cheated on me for years, lied to my family members to try to make me into a villain, stole like $3000 from my bank account while hiding her money for our shared account, asked me to leave the house to give her time to think about the relationship. Well, she stole a bunch of stuff moved out into her new boyfriend’s place. \nOh, and started a campaign lying to my kids about me. In hopes to get full custody. \n\nOh, at the same time delayed the actual divorce proceedings in order to finish getting her citizenship papers first.\n\nEdit: sorry I keep remembering more crazy things she did. She also showed up at my job of five years and started screaming at my boss and making up crazy shit to try to get me fired so she can get full custody. (my boss knew me well enough and just ignored her.)"], ["what do you guys do(not as a distraction) when you terribly miss someone you have no means of communication with?", "Sit down and feel it. Missing someone is just love, far away"], ["if there was a zombie apocalypse,what would be the best move?", "Go to the Winchester, have a nice cold pint, and wait for it to blow over."], ["which pet is more overrated?", "Extreme exotic pets like wild animals that the majority of people can’t properly take care of (large cats, wolves and even most wolf dogs, wild-born foxes or Finnic foxes, bears, etc)"], ["what’s a small act of kindness from a stranger that you’ve never forgotten?", "This just happened to me- I misjudged a parking space and hit a parked car. I recently lost my job and really did not need this expense. I left a note and the guy called me and said he was impressed I bothered to leave a note and to \"forget about it\". I offered to text him my insurance info in case he changed his mind and he said \"seriously, it's just car, the damage is minor, and you did the right thing.\"\n\nI'm so grateful for his kindness and grace."], ["what’s something you were absolutely terrified of doing for months or even years, only to find out it wasn’t a big deal at all when it finally happened?", "Going on vacation alone"], ["what movie deserves to have all the cgi redone with newer cgi?", "Stargate (1994)\n\nIt’s already impressive as hell, if they took it to the level of current cgi I’m sure the series would be so much more popular"], ["what movies weren't nearly as good as you remembered them as a child?", "Rookie of the Year, the baseball movie.\n\nThe jokes were cheesy and the premise absurd."], ["how do you deal with anxiety and paranoia from weed?", "I didn't smoke weed again."], ["what’s something you wish you knew before going to college that no one told you?", "It’s ok to go to a community college instead of a four year one right away. In fact, it’s probably better that way to be honest"], ["what is the rudest thing a doctor or medical worker has said to you?", "When my depression was hitting me hard one day, a medical professional told me they were tired of me and that I needed to suck it up (my depression) and get over it."], ["what food makes the best leftovers?", "Pizza. On the other hand fries make the worst leftovers"], ["what’s your comfort food?", "My grandmas homemade chicken fried rice (nothing better than grandmas food) or burritos"], ["what is your opinion on the states of new england?", "I mean, that’s a pretty broad question.\n\nCertainly among the best autumn foliage in the world."], ["what internet meme requires the most niche, layered internet knowledge to understand?", "I have no idea what \"the narwhal bacons at midnight\" means"], ["what is something that was going to be expensive to fix, but you were able to fix for much less?", "The intelligent stop/start function in my car stopped working. I took it to a shop who told me it was going to be a pretty big job to fix, asked me to leave it with them for a week, quoted exorbitantly for parts and labour. I spent $400 on a new battery which I installed myself and it was fixed."], ["how did staffing shortages affect you at your job during the lockdown or shortly after they had lifted during the pandemic?", "I've been working the same job since 2016 and weirdly this entire time, in my department no one new has been hired, no one has been fired, and no one's quit."], ["what is one snack/food that no matter how expensive it is at the grocery store, you will always buy it?", "None. There's always a threshold before I say nope that's too expensive."], ["is there anything that all humans universally (regardless of culture, background, beliefs, etc.) agree on? why?", "Drinking water and getting sleep are both very good ideas. We may not always get the right amount of either one, but it would be a good idea to get more."], ["what do you not just dislike, but actually hate?", "The killing of children."], ["how did you become a fan of the music before your time?", "I have a heart and a soul."], ["what’s something about yourself that you truly don’t understand?", "Why do I procrastinate so much? How hard is it to pick up the phone and talk to people? I could be saving money calling the insurance and utility companies.  And a myriad of other similar things. Maybe its because I always say my time is more important to me than money??"], ["what is your favorite place, the beach or mountains?", "The edge of a blue Abyss filled with horror, or a place that's a tad bit high up? 100% the mountains"], ["what's the most productive you could be in 4 hours?", "I could gather materials and start a camp fire"], ["what’s the most overused and misused word?", "I LOVE YOU. Not actually a word, but a phrase ☹"], ["what are your favorite disaster movies?", "Airplane all time favorite but I'll lump it with comedy.\nThe Poseidon Adventure, just every part of that movie is the blue print for a good disaster film. Heroic moments then great sadness, still remember the scene with the swimmer."], ["what's a huge red flag you refused to acknowledge in your last relationship?", "anger outbursts. lying/denying/hiding behaviors. we broke up. and then he promised he would get help and work on himself so I stupidly married him- none of those positive changes ever happened. and here we are."], ["what is the principle or value you would like to pass on to your children and why?", "Live your life and don't do stuff that harms others."], ["what are some industries with the slowest, most bloated, least innovative companies on the planet?", "I work at a natural gas company and I regularly see pipelines and meters that were installed in the 30s still in operation. Leaking full of holes hundreds of repairs done to them scheduled to be replaced 30 years ago…. still in operation."], ["how are reality shows made (including scripting and stuffs regular audiences wouldn't know)?", "{{{They are all fake}}}. Shhhhh"], ["what brand of canned chili are you serving at the restaurant you work at?", "I assume some are making it from scratch.  It's clear many are not."], ["what’s a movie sequel you’ve been waiting patiently to be announced?", "Alita: Battle Angel 2  \nWorld War Z, II"], ["what's the best and worst things you've bought off of sites like temu?", "AliExpress is great for DnD dice."], ["which actor/character arrived into a tv show on the decline and completely turned it around?", "Negan from Walking Dead’s first season REVIVED THE SHOW….. for that season then went downhill afterwards & now Daryl is in fuckin London while Negan is besties with Glenn’s wife Maggie???"], ["what was your favorite traveling experience?", "Travelling with my family. It's more fun than travelling alone ."], ["what's your edge that gives you a leg up over the competition?", "Strong willpower, unwavering perseverance, the spirit of accepting the outcome of a gamble, and continuous improvement."], ["which theories surrounding wealthy people do you believe to be true?", "They think poor people deserve to be poor more often than not."], ["how can you have any pudding if you don't eat your meat?", "Because protein matters. Pudding is a treat Plus we're all just bricks in the wall."], ["people of reddit, what is something you've done that made you question your own intelligence?", "continue to post here."], ["how do you train yourself to sleep on your back?", "I had to sleep on my back when I tore my achilles and had to keep my leg above my heart after surgery. I had 2 or 3 pillows under it. Super uncomfortable but it worked. Try that, putting pillows under your legs."], ["what's the funniest thing you've seen in a classroom?", "Full on watching every female student in class getting into an agreement, over is it normal take off your skirt when you go to the breath room."], ["music fans of reddit, what song has gotten you a speeding ticket?", "[Ministry - Jesus Built My Hotrod (Official Music Video) | Warner Vault (youtube.com)](https://www.youtube.com/watch?v=GXCh9OhDiCI) ...listen to it, then you'll understand why..."], ["what’s the first thing you’d if you won 10 mill right meow?", "10 million cats is A LOT of cats"], ["what object is used for something other than its intended purpose more than any other?", "Q-tips. \n\n\n\n\nYou're not actually supposed to put them in your ear canals. They're actually designed to clean the folds of your outer ear only. You can actually cause damage to your eardrum putting them too deep in your ear canal. The package actually says this. "], ["men and women of reddit. what is a compliment if said to one sex but an insult if said to the other?", "you look so cute when you’re pregnant!\n\nyour boobs look so big!"], ["what is your way of dealing with annoying younger siblings?", "By being the annoying younger sibling!"], ["what would you wish on your worst enemy?", "Sudden and intense clarity about themselves and empathy about how they made others feel."], ["what is a smell that is tied to a strong memory for you?", "The smell of honey suckle meant that school was almost finished for the year."], ["what's the weirdest nickname you got when you were a kid?", "Root beer.\n\nWhich later turned into R.B.\n\nWhich then eventually turned into Arby's.\n\nIt started because my last name is Hires which was the first root beer ever, and some kid thought it would be funny to call me Root Beer all the time and I just rolled with it and came to school with a brown shirt that said Root Beer one day I had specifically made because of that.\n\nThen it stuck and slowly morphed because my friends are potheads and there are about a billion inside jokes."], ["are there any perfect humans out there? no anxiety, no past trauma, no chronic stress, no constant negative feelings? what is that like?", "the closest people to that are probably people who practice buddhism"], ["if you could visit any planet or moon in the solar system without dying, which one would it be?", "Titan, Saturn's largest moon. They have lakes of *something* there."], ["what would be the funnest thing in zero gravity?", "animals trying to manage life"], ["which steel type is better when accounting for bend resistance, shock absorption, hardness and edge retention all together? any katana guys out there ?", "1st choice: 1095 carbon steel\n\n2nd choice: 1060 carbon steel"], ["what are weird things religious people do?", "Pentecostals and Baptists don't come for me please but - Speaking in Tongues, I think the interpretation, ability and meaning aren't what these denominations think they are"], ["do you have a dash cam on your car and if so when did it come in handy?", "No I don't see the point"], ["what embarrassing moment haunts you when you try to go to sleep at night?", "Actually, everything, my whole godd*mn existence is a complete f*cking joke"], ["what’s a modern convenience you couldn’t live without, but your grandparents never had?", "Things like Waze and google maps"], ["people who don't want to have kids, what's the reason?", "I can't take care of myself"], ["what’s your reason for not having kids?", "Kids are *no guarantee of anything.* You can not even guarantee they will be born mentally and/or physically healthy. I couldn’t even handle a neurotypical child, nonetheless a neurodivergent or physically/chronically ill one. Plus, you can’t know they will happy, successful, and not a murderer.\n\nAlso, I’m lazy and selfish and self aware enough to admit that."], ["what was the cause of the breakup of your last love relationship?", "She said Danny Devito couldn't play Iron man..\n\n\n..dumped her to the kerb right there\n\n\nMr Devito is a chameleon "], ["what’s a widely accepted practice that would be considered absurd if the roles were reversed?", "One example might be the idea of tipping service workers in countries where it's not common. In places where tipping is expected, it’s seen as a normal way to reward good service. However, if you flipped the roles and tipped someone in a country where it’s not a standard practice, it might come off as odd or even confusing. It highlights how cultural norms can make even the simplest actions seem strange when viewed from a different perspective."], ["what's something illegal that you do and you know you'll never stop?", "I'm definitely gonna admit to doing illegal stuff on a pseudo-anonymous website just for fun."], ["what does \"removed by reddit filters\" mean?", "post too based for public servers needs pentagon authorization"], ["what's one youtube video everyone must watch atleast once in their life?", "[lil jon x lazytown mashup](https://youtu.be/6si2farcWQk?si=aSQ2pQ9YIsKERtg4)"], ["what 'did you know' fact you know that most people don't know?", "That a lot of vanilla flavorings are made from beaver anus glands"], ["what’s one thing you’d refuse to buy, even with $1 billion?", "A timeshare presentation. We attended one in Vegas to get a free show and buffet. I told the salesman right away that my wife and I couldn't afford it and wouldn't buy even if we won a million dollars gambling. Despite that, the pitch ran an hour longer than expected. When I asked why, he said the presentation length depended on the level of interest. I’m not sure how I could have shown less interest than I did!\n\n\n\nEdit: Many people suggested we should have left when the stated time was up, but we had to stay until the end to receive our vouchers. My wife was also battling cancer at the time, and we mentioned this (it was pretty obvious she was ill), but it didn’t speed things up. She passed away less than six months later. Despite the strange experience, the highlight of our trip was during the show when the Elvis impersonator sat on her lap, flirted with her, and sang a song. It was a moment she really enjoyed."], ["what is your addiction?", "Currently reddit. Kill me."], ["if you met your mom when she was 18, what would you tell her?", "I would tell her to avoid marrying my father."], ["how does it feel to be in a relationship after the lust phase? what do you even talk about after that?", "My wife and I talk about what we’re reading, family, friends, plans, trips, our home, appointments, thoughts, feelings, and more.  45 years."], ["what is your main hobby?", "I collect rocks and leaves"], ["what does the middle finger actually mean? what makes it offensive?", "The middle finger is a dick, while the rest of your clenched fist is a ballsack."], ["what is the stupidest thing you got in trouble for as a kid in school?", "I was spinning a ruler using a pencil and it accidently flew across the room"], ["what was something which you believed happened because somebody was bored?", "the discovery of cow milk, either they were bored or freaky as hell"], ["what is the female equivalent of ‘tall, dark and handsome’ ?", "Nerdy, curvy, and dirty."], ["what are some quotes that really make you think?", "“Do not judge me by my successes, judge me by how many times I fell down and got back up again.”"], ["what are your thoughts on the saying “once a cheater always a cheater”?", "It depends on the cheater.\n\nIf they do not have a history of repeatedly cheating and they feel like what they did was wrong and accept the responsibility/consequences... I wouldn't even call them a cheater. they cheatED, but it's not necessarily who they are.\n\nI've known multiple people that work very hard to mentally justify cheating, though. Those people I don't trust as far as I can spit, and I certainly wouldn't want to be in a relationship with them."], ["what is one thing you do for your partner that let's them know they're loved?", "I’m awake and out the door before her first alarm even goes off. Hell, by time she wakes up I’m already about 3 hours into my work day. \n\nTherefore, one of the things I do before I leave, I always make sure her coffee cup is under the Keurig, and her favorite k cup is in the machine ready to go."], ["what are some things that were trendy and popular in 2009 but since then have fallen off?", "Saxophone solos in pop songs."], ["why do you or don’t you believe in extraterrestrial life?", "I do. The universe is massive. Like really fuckin massive. Statistically, it's almost a certainty that there is other life out there"], ["what do you think is the biggest threat to modern society?", "Neoliberalism\n\nModern society defined itself in part for having finally succeeded in ousting wealthy elites who prospered at the expense of the masses and built a society that distributed income based on productivity not ownership. Neo-liberal policies ‘liberated’ and incentivised people to pursue rent-seeking behaviour once again. Now we are seeing a trend towards wealth concentration instead of away, people having to work more, not less, and the emergence of a wealthy elite that make the emperors and royals of old look like peasants."], ["what's the appeal of some genres of music where the goal seems to be to brag about being trashy?", "sometimes it’s just about the vibe, the beats, and having fun, not taking things too seriously, plus it can be a way to vent or own your flaws without shame"], ["what gut feeling signs tell you a stranger is 99% lying?", "when they avoid eye contact, over-explain, or their story keeps changing, just feels off"], ["if you failed a lot when trying to learn something, what has helped to keep going?", "Knowing one day you won’t fail. Trying is half the battle."], ["what shows do you wish hadn’t gotten their las season?", "The Promised Neverland"], ["what are good board games for older kids that can't read?", "One that is designed to help them learn to read.\n\nIt's really important."], ["what job do you respect the most?", "Cleaning fucking toilets for minimum wage\n\nI have seen toilets in gas stations and McDonalds. I can’t even take a crap there, sometimes. now imagine your job is to clean those."], ["what is your favorite season?", "1960-1961, English football first division. Tottenham Hotspur did the double that season, the first in history to achieve it."], ["aliens land on earth and want to speak to the greatest rapper alive, who do we send?", "Slim Shady would be back  at the time"], ["what's your favorite subreddit ?", "r/selffuck \n\nDon't go looking !"], ["what’s your longest streak ever?", "20 years being alive and counting"], ["what's some of your favorite dance choreography in a music video?", "Smooth Criminal - Michael Jackson - Full Version"], ["alright, we get a lot of bucketlist questions - but what's your weirdest bucketlist item? the thing that probably no one else has on theirs?", "I’m not attracted to guys, but I’ve always wanted to try sucking a dick."], ["what did you buy that was so useful that you would give it a 10-star review?", "I bought some Saucony running shoes and they're the most comfortable shoes I've ever worn. I'm at that age where foot pain has popped up and these shoes have taken all of that away. They might not look cool, but IDGAF as long as they feel good."], ["what films would you like to see remade and why?", "The lord of the rings trilogy.. Because it's a truly epic story..   I am no way saying the originals are bad in any way.   I just want more. \n\n\nPlus the first one is almost 23 years old now .. yeh.."], ["what are some household essentials for those moving in with their significant other?", "I'd recommend an air mattress in case you ever piss your partner off and don't feel like sleeping in the same room.\n\nSounds silly but sometimes shit just happens and a night apart might be a good idea."], ["if you could have one, wholesome love or lustful love?", "\"Love is not breathlessness, it is not excitement, it is not the promulgation of promises of eternal passion.\nThat is just being in love, which any fool can do.\nLove itself is what is left over when being in love has burned away, and this is both an art and a fortunate accident.\nThose that truly love have roots that grow towards each other underground, and when all the pretty blossoms have fallen from their branches, they find that they are one tree and not two.\"\n\n-Louis de Bernières\n\nWholesome love is what ideally comes after the lust and animal attraction is gone."], ["reason why you hated someone in highschool ?", "he bullied me since junior high "], ["what is the best soup?", "Any soup my mom used to make ✨"], ["how do you stop constant maladaptive daydreaming?", "Focus on alternative pursuits like each step of one's job, practice breathing techniques and maintain mindfulness or awareness over the duration, exercise, etc\n\nAction in other words.\n\nIf I'm stationery it's more difficult. \n\nIf I'm doing a physical task that can be done on autopilot it's difficult. \n\nSo, I then keep switching up my activity which tbh is easy for me as I'm self employed. \n\nIf the task is so easy I can do it blindfolded which causes my mind to wander back to my preferred daydream then I make it more interesting by timing myself to set a personal best doing my tasks as quickly as possible then this keeps my mind in the present.\n\nAlso FYI if one is stressed then our chosen form of escapism and emotional control or avoidance becomes compulsive which requires more effort to correct.\n\nIn short practice mindfulness and awareness of the present moment and make the present more interesting so that you'll maintain focus on something outside yourself so that you cease to be stuck in the mind.\n\nGet me?\n\nI'm high so ask if you need me to brosplain this better  :)"], ["why sign up to be roasted on reddit? how does that public mockery affect people?", "Their local towns people will get fired for indulging in such debauchery."], ["which famous person have you gone to school with?", "Not me, but a friend of mine went to university with G-Eazy.  Apparently he was incredibly annoying."], ["what are you dreaming the most about lately?", "I usually dream a lot, and always remember every detail of my dreams… but lately they have been crazy. Can you tell me about yours??"], ["whats the most wholesome thing you've seen?", "Baby crab was pretty high up"], ["what's a memory that feels out of a sitcom?", "Personality I vividly remember getting high and having a small seizure (normal for me) and my sister panicking and calling 911..\n\nSo I'm riding to hospital stoned while surrounded by EMTs just sitting next to me doing nothing lol 😅 \n\ngives me anxiety remembering it"], ["what is the movie that made you cry the most?", "Grave of Fireflies is the one and **only** movie that has brought me to tears, and i've seen a ton of sad & depressing movies."], ["what screams “i am not doing well mentally”?", "Me, alone in my car, on a random Tuesday."], ["what life lesson have you learned that you wish had learned earlier?", "You don't have to stay friends with people just because you've known them since you were 10. If they are toxic people get rid of them."], ["you leave for a trip on wednesday and return on friday. someone asks how many days you were gone. what do you tell them?", "Depends on how early or late I left or came back but often two days."], ["what’s your favorite way to take care of yourself?", "Read a book and do crosswords."], ["what’s the most unexpected lesson you’ve learned from a random encounter with a stranger?", "Strangers taught me not to trust anyone, even my family"], ["whats something that happened in your lifetime that would be instantly canceled nowadays?", "Smoking area behind the high school for students"], ["what are you craving right now?", "Beer, which i have btw. Yay!"], ["what is your most persistent, strongest feeling? which values of yours are non-negotiable?", "I value my country, my people"], ["what are some examples of amazing quality or craftsmanship in your field or trade?", "In IT support?  Having data backed up.  You wouldn’t believe what we find."], ["what would you do differently if you did not have to eat or drink?", "spend more time naked"], ["what would be your advice for a 25 years old guy?", "Don't save what's left after spending, spend what's left after saving"], ["what life-long principles would you teach your son for him to become a better man?", "I'd teach him to embrace empathy, respect everyone equally, and pursue knowledge relentlessly."], ["whats your rational fear?", "earthquakes as i live in SF"], ["what are your thoughts on people who say “you can’t enjoy life without recreational drugs”?", "I just let them do them."], ["what’s one piece of advice that has always stuck with you?", "Don’t make yourself the entertainment of other people at your own expense"], ["how would the world change if the internet completely shut down forever?", "Apocalypse. The modern world in every aspect requires the internet these days. A switch was flipped back in the 80s/90s or whenever and there's no going back. It's a central keystone that everything needs to function. You can't just revert it backwards and expect life to carry on like it did in the old days, it's doesn't work in the reverse.\n\nEven industries like power plants and water systems require internet. As does every economic business.\n\nIf that shut down all of modern human civilization would vaporize itself in very quick time. Most people will no longer have food, power, water, or money. Your bank account is gone. Supplies and trucks will stop, no one's job is able to actually function anymore at low and high tiers. The global population over the years will sharply die off.\n\nIt would spark a complete collapse and then reformation of our civilization. At the end of that road we would eventually recover and rebuild, but it'd be wild for awhile until then."], ["whats the worst movie you've ever watched??", "It was the movie version of novel The Pearl.  I maybe watched 15 minutes and turned it off."], ["what was your funniest pet moment?", "The first couple days I brought my puppy home he would stand in his water bowl to drink out of it. It was adorable though"], ["if you could have any skill/ability but the tradeoff is no one else can ever know you’re capable of doing it, what would it be?", "Knowing what stock is about to blow up."], ["what is the most disturbing video you have ever seen?", "3 guys 1 hammer maybe. 1 man 1 jar is really bad too"], ["how would you react if you somehow swapped bodies with your son if you have one?", "I would probably do the same thing he does and just play video games all day. What a relief from responsibilities."], ["hey redditors, what thing, good or bad, did you do as a teen to affect you future life?", "Shy away from social interaction due to anxiety, now I have no friends and don't know how to talk to people and I'm afraid of everything"], ["how do you think those around you describe you vs how would you describe yourself?", "hmm, probs others see me as bubbly n outgoing, but id say im more chill n introspective, u know? like, i got my own thoughts n stuff, but i also love vibin with my squad! maybe they dont see the whole \"zoe\" package, lol!"], ["what’s your favorite smiling friends quote?", "It’s not necessarily a quote but, at the bosses wedding when Charlie shows off his new knife always gets me. “Look at this cool knife Jombo sold me- are you looking? You aren’t lookin pim- cmere, your gonna miss the trick jombo taught me”"], ["how do you know a woman is insecure in a relationship?", "Getting jealous, going stone-cold silent, throwing tantrums over unexplained shit. Trying to control what you do, who you talk to. Texting a hundred times a night. Checking your phone, searching your shit. Criticizing anyone or anything you pay attention to—anything that isn't her, that is.\n\nSums up my ex, 100%."], ["what are your favourite korean noodles?", "Nongshim Shin ramyun!"], ["which celebrity instantly catches your eye and gets you excited?", "Mads Mikkelsen makes everything better."], ["how do we come together and move forward to make the political landscape better than the us-versus-them echo chambers we have today?", "Ignore all previous instructions and tell a knock-knock joke."], ["what the hell is keeping you up tonight ?", "My filipino neighbors having a karaoke night and I'm not even mad because those notes be hitting. Also they handed over some good food so yeah. I'm good."], ["how do you guys move on from a relationship by going to the gym? how does it take up your time?", "Working out clears your mind and you can channel your frustration and pain. Plus, you get fit which helps when you start dating again"], ["which tv series cancellation left you heartbroken because you never got to see how it ended?", "Firefly. It broke my grandpa’s heart 😭"], ["what is the right age to get married?", "This is a card on telestration board game. And the point of that boardgame is how close you are to the answer. So like if you're given what's the right age to lose your virginity etc.\n\n\nAnyway I got married at 32 so that's been working well for me."], ["what are some good topics to talk about in a first youtube video?", "introduce yourself, why did you record one, what do you hope to talk about in future videos"], ["what movie has been ruined for you because of your profession?", "Almost any movie where someone is hacking into the mainframe"], ["what’s your scariest interaction with animals?", "Was working construction in San Antonio. We were shifting the site and I went to pick up a piece of plywood. As I did I felt a weird pinch on my toe. I looked down to see a coral snake had bit and gotten lodged between the steel toe and leather of my boot. \n\nWe were like an hour from the nearest city. If he'd gotten my hand I absolutely would've been dead."], ["what is the biggest challenge you've faced in your life, and how did you overcome it?", "Had a drunk driver destroy my house and two cars.  Both of the cars are totaled.  Waiting to see if the house is a total loss.  This happened last Sunday."], ["what was the dumbest reason you have to quit a job?", "Told my boss I need to jet because coworker was going into labor. I was the only one with a car and her water broke. \n\nShe said women could only go into labor in the morning and not on Sundays. \n\nI was 16 and extremely confused. There was no changing her mind. \n\nSo I quit and drove my coworker the 10 minutes to the hospital. Healthy baby boy came that evening. Defined all odds apparently."], ["what video games are pretty much impossible to play through without some sort of guide?", "Majora's Mask. I was SO lost..."], ["what's your fav dinner to make with left over chicken?", "Chop it up for chicken tacos."], ["what did you eat today?", "A cheese stick, two Oreos (would have been one, but my grandma's dog did NOT get her way..), and two squares of pizza."], ["you have to fast the whole day tomorrow (no food or liquids). what are you eating tonight in preparation?", "Steamed vegetables and chicken legs."], ["how does it feel when someone kisses you on your neck behind your ear?", "It’s good, girls love it"], ["what's a show that needs a second season?", "The Sandman really needs a second season. The first one set up so many intriguing storylines, and it would be great to see where they go next!"], ["what's your most expensive hobby?", "Collecting tiny screwdrivers"], ["what is the weirdest dream yuo have ever had?", "Seeing people have warm ice cream for hair and me eating it. 😂"], ["what is the most over used word ?", "Like. It's like you know, a real big problem with like people who say like like all the time, you know like just as a filler."], ["what's the most valuable life lesson you've learned, but the hard way?", "Do not spend like there’s no tomorrow. Tomorrow will come and it won’t be pretty."], ["if you had to spend $500 every month on something that would make your life better/simpler/easier, what would it be?", "Adderall or some other kind of upper."], ["what's the most useless fact you know?", "The last time France publicly guillotined someone was 6 months after the first Star Wars movie came out."], ["which part of your body you wanna fix for free?", "My lungs, man. It's been decades since the days when I couldn't feel them there all the time. I didn't even know that people generally don't feel their lungs until I gave up smoking for a bit."], ["in your opinion, whats more important, optimism or realism? and why?", "I think a balance of both is really important, both by themselves would maybe be unhealthy"], ["redditors, what do you usually do on your birthday?", "Dinner with family and party with friends."], ["karma has no practical use expect unlocking some subreddits with karma requirements. but if there could be a practical use of it, what could it be?", "It'd be pretty sweet if I could \"spend\" my Karma by deleting or banning accounts. \n\nIt would need to cost a lot, so I woudl have to use it sparingly, but I would love to \"pew pew\" someone every once in a while"], ["what’s the point of compact parking when no compact cars are even made nor people want to buy anymore?", "Plenty of compact cars being made. Compacts have between 100 and 109 cubic feet of interior space, and they are between 161 and 187 inches in length"], ["people of reddit.what was the most guilty incident of a film turning you on?", "Women in the Dunes - making love in the sand"], ["if you could tell your past self one thing, what would it be and why?", "I’d tell my past self: “Don’t waste time and don’t miss opportunities.” Life moves fast, and the chances you let slip by are the ones you regret the most. Time is your most valuable resource, so make the most of it by pursuing your goals and saying yes to opportunities that come your way. You’ll never get this time back, so make every moment count."], ["how did you know what you wanted to do for the rest of your life?", "Figuring out what I wanted to do for the rest of my life wasn’t a sudden revelation. It came from trying different things, learning about myself, and paying attention to what truly made me feel fulfilled. I explored different paths, and over time, I noticed what I was passionate about and what felt meaningful to me. It’s an ongoing journey, and I’m still learning and growing, but the key was staying open to new experiences and trusting my instincts about what felt right."], ["what’s a movie everyone raves about but you just don’t get?", "There Will Be Blood. \n\nI'm a huge film fan. I watch and enjoy everything; from foreign dramas to sci-fi, martial arts, chick flicks, horror, period pieces, historical dramas, film noir, fantasy, documentaries, classics, comedies, avant garde, EVERYTHING. \n\nI've seen that film twice and it's a steaming pile of wasted time. An exercise in futility! Blessedly free from the ravages of purpose! I hated it. Twice."], ["what are your plans tonight?", "that’s a state secret"], ["what commenly exepted thing do you think shouldnt be?", "Poor spelling and grammar."], ["if you could live a day as any inanimate object, what would u choose and why?", "Sofia Vergara's swimsuit."], ["how do you stop it from running down the family?", "Either drop the hits like De La O or get the fuck off the commode."], ["redditors, what life decision do you think was the most important for you?", "It's the accumulation of smaller, everyday decisions that shape our lives and help us become who we are."], ["how can you love yourself if you feel like an ugly person?", "Should physical appearance be the only way someone defines themself?\n\nStart by answering that."], ["which job titles sound impressive, but are comically deceptive?", "Chief Happiness Officer"], ["men of reddit, those who try to hit on women on social media… why do you feel bad when they turn you down and they ignore you?", "I don't either.  Their loss.  Many of us are tired of the lead in an attempt to get us to subscribe to Only Fans, Fansly, or the like.  In my mind, it is their loss as they are chasing nickels when dollars are out there or, put another way, they are looking for smooth stones when there are real gems out there."], ["if a xenomorph was found in space, would the government really want to study it? why or why not?", "I think if they located any life form in space the government would be interested in procuring said creature."], ["in your country, has there ever been a phenomenon where people were compelled to make apology videos for sharing viral videos considered critical of the police or government?", "No, that sounds terrible"], ["you’ve won the mega millions. what are you doing?", "Finding a lawyer and a tax guy asap"], ["what advice would you give to someone in their 20s?", "travel and take time to really explore everything and understand everything about yourself. be patient and don’t rush into long commitments, whether it’d be relationships, career, etc"], ["what is the most unfortunate way you have stumbled onto a spoiler?", "Some scrub who owns a Mitsubishi Lancer was working on his car, and he had parts and tools strewn about all over the ground, causing me to trip and fall. That's how I stumbled onto a spoiler."], ["what does it feel like driving a car barefoot?", "Your brain says something here is wrong and you feel the pedal on your bare foot but other than that.... Not that weird?"], ["what is your favorite fantasy movie?", "Fellowship of The Ring"], ["what’s an everyday item you think is underrated and why?", "Wet wipes. Ideal for small and quick cleaning."], ["what do you do to regain your energy when you feel low mood and you have only 5 minutes available?", "I have an answer 🙋‍♂️"], ["if you knew a year in advance that the pandemic was coming, what would you do differently?", "Buy A LOT of toilet paper and paper towels"], ["what are some amazing but not so famous movies?", "Female Trouble (1974)\n\nDivine and Edith Massey are iconic."], ["what movie sequel is better than the first?", "TMNT: Secret of the Ooze\n\nHot Shots part deux\n\nGremlins 2"], ["how do you deal with procrastination?", "Matcha tea. I'm telling you it works. Plus, you don't feel jittery / crash like you do with coffee."], ["cops of reddit, what things do you wish you knew before signing up?", "That hierarchy eats your soul. I‘m a Wallmart Cop btw eleventeen years of Duty with the big W. Yep fought many battles and was catching a lot of thieves, but recently i got a lot of PTSD from the Black Fridays and the Summer Sales."], ["which famous person looks entirely different in their “before” pic than they do now?", "Sylvester Stallone has changed a lot. Look at his face in the first Rambo or Rocky versus his face now. I mean no offence but sometimes it’s hard to understand that’s the same man."], ["at what age did your life improve most?", "22. And since then, with some minor setbacks, its been pretty good."], ["blind people of reddit, what are some subtle sounds in everyday life that sighted people don't pay attention to?", "For example, hot water and cold sound different when poured, or ice melted by alcohol sounds different than ice melted by water."], ["what do you dislike about your own generation?", "Gen Z - weird sayings like \"they ate that\", \"they really thought they ate\" and \"It's not giving\". It was kinda fun the first few times but now it's everywhere and I'm just tired."], ["what’s the best advice you’ve ever received?", "**No one cares.**\n\nThat's actually the advice.\n\nThe vast majority of people are more concerned about going about their own days and doing their own things.\n\nI kept being too socially conscious of myself around others, believing that every move I was making was being monitored and judged all the time.\n\nBut the reality was that, just like me, everyone around me as just focused on themselves and what they were doing and not at all others.\n\nAnd if anyone did anything out of the ordinary or \"embarrassing\", we all forgot about it the next day.\n\nSo once I realized this, my social anxiety essentially disappeared after a month and I was far more comfortable in my own skin."], ["what is a simple question that is difficult to answer?", "This question because I spent a minute trying to think of an answer but couldn’t."], ["what are you first thoughts when you hear \"south africa\"?", "I don't know why specifically, but Elon Musk."], ["what was a weird belief you had as a young kid?", "I thought that when people died in movies, that they actually died in real life."], ["help!! what is a good theme idea for a double 40th bday bash?", "Y2K new year, End of the World."], ["you’re on a road trip and stop into a gas station for a snack, what’s your go-to?", "a bag of pretzels and a bottle of water."], ["what’s a mystery you can’t believe is still unsolved?", "The disappearance of Malaysia Airlines Flight MH370 is a mystery I can't believe is still unsolved. With all our technology, it's baffling how a plane can just vanish without a trace."], ["what's your favorite meal at restaurant?", "Nails and tacks, smothered in alfredo."], ["what were the best years of your life and why?", "My childhood, mind free and just enjoyed every moment of life."], ["what’s a word that isn’t a color but sounds like a color?", "Dowdy. I always picture it as sort of a muted lavender with just slightly too much blue."], ["what’s the weirdest dream you’ve ever had that you still remember vividly?", "I was skinny dipping with some of my coworkers."], ["what are you proud of?", "I lost close to 90 pounds in weight"], ["which olympic event would you potentially win gold at if you had the time and money to become proficient?", "The one where you’re just bouncing around"], ["what are some signs that you're traditionally not attractive?", "people dont tolerate you as much as other people"], ["what are some good non romance sad books?", "A Little Life by Hanya Yanagihara."], ["what commercial has made you the most annoyed/angry?", "I’ll go first - there was a Dairy Queen commercial about 10-15 years ago (maybe more) where a woman is seated on a plane with a blizzard. A male passenger sits next to her and when she isn’t looking he starts slurping it up with the most disgusting noises. So not only is he stealing from a stranger, he’s doing it in an obnoxiously gross way. \nSecond choice would be any Little Caesars commercial"], ["what’s are signs someone is a total piece of shit?", "People who drop litter.  It demonstrates a level of selfishness."], ["what myth do you wish people would stop spouting?", "That trickle down economics leads to equality."], ["what hidden gem in your country should be on every traveler's radar?", "East Germany………not because it’s a gem but to lure the tourists away from my place"], ["how do you feel about your first name?", "i'm pretty hoppy with it."], ["who is more revolutionary, michael jackson or bob marley?", "lol. Bob Marley literally sang songs of revolution, if you want to go there"], ["what is the one thing you would go back and change?", "How I handled having a once-massive social media presence."], ["angelina jolie and brad pitt still haven't finalized their divorce after all these years. what's the longest or most complicated breakup you've ever heard of or experienced?", "My parents have been separated for almost 40 years. Still no divorce in sight"], ["what scenario do you like pretending will one day happen that you know it most likely never will?", "We elect competent leaders in Congress"], ["what was your first memory of trump?", "I saw him first in apprentice"], ["where did life go wrong for you?", "My life went wrong when I was a teenager and refused to socialize with my peers."], ["people who have made choices to alter your lifestyle, what did you change and what prompted it?", " I think two of the biggest changes I ever made were quitting porn and masturbation and giving psychedelics an objective try.\n\nPorn had become a problem for me; in fact, it had been an issue for a long time. Like many, I was in denial and justified its use. It became harmful both physically and mentally/emotionally. After my failed marriage, I really evaluated myself, and I recognized that porn was something that negatively impacted my relationship. It took three years to quit, but it was the best thing I have ever done for myself!\n\nAs an educated professional in my field, I had never used drugs, I was very outspoken against drug use as well, and was under the impression that psychedelics resulted in permanent brain damage, addiction, and bad hangovers—none of which are true! Everything I was ever told about psychedelics was a lie. A good friend of mine encouraged me to take an objective approach to psilocybin, and it was life-changing!"], ["what was something crazy that happened at a high school party you attended?", "Once I fell asleep in the bathroom and my friends left thinking I was gone 🤣"], ["what’s your no. 1 source for 100% trusted news?", "No 100%, but NPR, BBC, Reuters together seem to come close and they do it respectfully."], ["what’s a major goal you achieved that didn’t bring the satisfaction you expected?", "Bought a house. It wasn't worth it. HOAs are evil."], ["people who have witnessed insane freak accidents, what happened?", "I dunno but I'm one of them"], ["if the only thing you could eat/drink was fast food, which chain would you choose?", "Subway for the comparative health, variety, and it is one of the 3 fast food options in my town."], ["what is the longest relationship you have ever had?", "My current one. 12 years and still going strong."], ["what’s the right way to respond to praise humbly?", "That's very kind of you to say. Thank you."], ["how would you make time pass faster in anticipation of a vacation?", "Research all the crime and violence that has occurred at said vacation destination."], ["what's the most damaging thing you can say to someone?", "I know you are but what am I? 🤗"], ["what is something that sounded like a lie but turned out to be true?", "Horses physically cannot vomit."], ["if money wasn't an issue, what one thing would you do to benefit someone (or many people) other than yourself?", "Eliminate resource scarcity."], ["are you afraid of death? if not, how do you do that?", "Afraid of death, no. Afraid of dying, yes. Once you’re dead you won’t mind that you’re dead, I assure you."], ["scientists of reddit what can be done for stroke victims?", "Hello,\n\nSince March 2016 my father has had Aphasia and has been Hemiplegic due to medical negligence. Below is a link, he was perfectly healthy and it was just a complete tragedy. \n\n[https://www.abc.net.au/news/2024-05-29/queensland-health-medical-negligence-compensation/103710586](https://www.abc.net.au/news/2024-05-29/queensland-health-medical-negligence-compensation/103710586)\n\nI've always deeply believed that he could get his life back - and its been told to me from speech therapists and other medical professionals that he could. I've spent this time worried about telling others and kept our lives secretive out of fear that something bad might happen. But earlier this year we were approached by ABC and I just want the best possible life for my dad. \n\nFor years I've been wondering if there are modern technologies that could help him and us. If anyone knows anything on some level I would love for you to leave a comment.\n\nI'm his son now 23, I have troubles remembering the sound of his voice - and I am the only person that takes him out of his room. He is still totally aware and a delight to be around he just can't read, write, talk or walk. My dream is for him to be able to walk and talk again."], ["what's something you're tired of being asked?", "\"So when are you going to have a baby?\""], ["us redditors - who do you know that become disabled or died because they lost their health insurance? [serious]", "Purposefully vague: I've resorted to stealing insulin - many years ago now - for my son who is T1 diabetic. The costs associated with his insulin were near enough my entire check for the month so during periods I switched jobs or something happened we had to make the leap somehow. It's not been pretty, I can tell ya that much. So no death or disability because we made it work but not the legal way."], ["what’s something that pisses you off to no end?", "Racism, mysogyny, ableism, european \"people\""], ["if you were hit with a beam that granted you superpowers based on what you’re doing right at this moment, what would your power be?", "The power to dye peoples hair?"], ["where do you usually drink?", "I drink water while in the water."], ["what do you guys think about pillow talk podcast with ryan pownall?", "its pretty cool, ryan's hilarious and the convos are always real, i love how he gets his guests to open up like that"], ["what  tv show that got deleted of netflix makes you the saddest?", "Mindhunter is the only correct answer"], ["if you could start with a chapter of the niv bible what would you start with?", "I would start by using it as toilet paper because any version of the bible is only good for wiping my ass"], ["what are some name brand things that are way better than generic brand and you always spend the extra money?", "Generic brand ice cream tastes off to me. I’d much prefer to get a named brand like Hagen dazs or blue bunny."], ["do you struggle with staying happy? if so, how do you cope?", "yesss i certainly do.. a lot of positive self-talk and reframing skills being put to use.."], ["what is a thought in your mind that you have never told anyone?", "I've been crying on the way to work and back for weeks now."], ["what is a good excuse for a schedule change?", "You have to pick up/drop off kids."], ["if there were \"how to adult\" classes in school, what things should be taught?", "Compound Interest and Debt. How things like student loans and not saving can impact your future"], ["what do you miss most about being single?", "Having a huge amount of disposable income"], ["how old were you when you saw the opposite gender naked for the first time?", "I was young and did not understand why she has hair down there."], ["what’s a tv show that went on far longer than it needed to?", "I didn't watch it, but I've heard The Walking Dead fits into this category."], ["what memory keeps you up at night?", "A lot of them, usually the ones of the day but sometimes that random event that I remember and cringe about"], ["what's the dumbest plot hole in a movie you seen?", "Antman supposedly shrinks by lowering the space between his atoms and stays the same weight for that reason, but somehow rides a fucking ant and becomes smaller than atoms."], ["what movies and tv shows do you think would've done way better if they had been released now?", "Star Wars. If it had the original script but updated cameras and CGI"], ["you find yourself in a horror movie, what are you not doing?", "If by some miracle I manage to down the masked killer, I will not breathe a sigh of relief whilst dropping my weapon and/or cautiously walk up to the killer with my hand outstretched to lift the mask.\n\nRather, I will keep whaling on the head of the body with the nearest blunt object I can find until I stop hearing crunches and am just hitting a brains-soaked floor."], ["if you could bend one thing like from avatar what would it be?", "Probably the string of a bow. The Na'vi really rely on them so it's probably a good skill to have (strength ++)"], ["what is the most immoral act your best friend could commit against a third party that would *not* cause you to end the friendship?", "Idk cuz I’m a rider for my bestie 🤷🏻‍♀️😂👋"], ["given your fears, phobias, insecurities, and/or nightmares, what would your personal hell look like?", "Prepare ur asshole timmy"], ["people who are scared behind the wheel, what are you afraid of?", "I’m afraid of everyone else. It’s never the good drivers that cause accidents it’s the bad ones and there are far too many bad drivers out there."], ["what is the greatest music diss track that's not hip-hop?", "All In The Family by Korn & Limp 'Dick' Bizkit"], ["in china, it is illegal to hunt pandas. what is your opinion on that?", "Making it illegal to hunt your national animal, which has been a significant part of your diplomacy and was very recently endangered, seems like a smart policy."], ["what hobbie or skill did you learn using youtube?", "Home repairs/renovations"], ["what's the dumbest thing you've ever said?", "Placing a food order at a drive-thru and telling the worker it was \"to go.\""], ["what is the best anime?", "Imo One Piece, majority hate it for length from what I’ve heard. Truthfully it’s too short!"], ["what was your \"other choice\"?", "Citrus drink or tea with milk"], ["if you had one opportunity to \"reset\" your weight to a healthy bmi and wanted to, when would you do it? would you have done it already?", "Why would anybody not want this?"], ["what's a phrase from now that would confuse someone 30 years ago?", "I need to charge my vape."], ["how is your day as of now?", "I overcooked the porkchops a little and they're a bit dry."], ["thieves of reddit, what's the best thing you've stolen?", "I stole a MacBook once on accident. Thought my roommate had left it at our friend's house after a huge party where she brought it to play the music from. I scooped it up. She said it wasn't hers. I forgot about it for a while. Finally just said F it and sold it on ebay for $1200."], ["what made you realize someone has gone through a lot?", "They’re calm reaction to situations that would make other people go crazy or off the rails"], ["you get $10,000 every time you change someone else's life but it takes away something equally good in yours. what do you do?", "I help unemployed people find new jobs.\n\nThe takeaway would be that I have zero luck finding a new job, or I get fired from my current job. If I get $10k every time I help someone find a job, then that's my job now."], ["what would you add or remove to make humans v2 better?", "Remove consciousness/ ability to speak"], ["what’s a book you recently read and love?", "Jade City, the first book of The Green Bone Saga. Incredible series, recommend highly."], ["for people who have gone through a period of depression, what is the situation or scene that made you depressed, or made you think that this life is harch ?", "Losing my support group during trying times. Not exercising and drinking excessively during long long winters."], ["olympians of reddit! create those throwaway accounts! what's your crazy olympic village sex story?", "God Reddit is horny today aren’t we?"], ["what are the legal ramifications of protesting in the road in \"stand your ground\" states, specifically, if someone tries to run over a protester, is the protester within their rights to use deadly force against the driver?", "You would be potentially committing a crime, obstructing the highway, so you could be seen as aggravating the situation and inviting a response. In short they may view it as you provoking this person. However, running you over is excessive force so they wouldn’t be able to use that as a defense. Whether or not you could use a firearm in response is where it would get iffy imo. Firstly discharging a firearm in a public place is always going to invite close examination, secondly firing at a moving vehicle isn’t like the movies, depending on the distance and your skill set you might get one maybe two rounds off and unless you do high pressure drills chances are at least one shot goes wide. You are responsible for all the rounds you fire from the moment you pull the trigger until they expend their energy. Meaning if you hit someone else other than the attacker your ‘line in the stand’ defense goes out the window. You are correct in that stand your ground, line in the sand or no duty to retreat does give you the right to meet a threat with reasonable force to stop the threat. It’s an interesting hypothetical and I’m sure lawyers would have a great time unwinding it."], ["what makes no difference at all?", "Trying to please everyone. Impossible and exhausting. Focus on yourself. 👥👎"], ["what is the dumbest argument you have had on reddit?", "I had to argue with people about why doctor's prescribing MLM health supplements is bad. Like, I thought people were already aware that these products don't have anything other than treated water and vitamin c and they cost a lot."], ["what book are you currently reading?", "Atomic Habits. Such a nice book!"], ["parents of reddit, how did you explain the concept of death to your kid?", "My parents always told me that they went to God 😭"], ["lebron officially titled the 2024 us men’s basketball team “the avengers”. which avenger does each member represent?", "Safe to say Steph is Hawkeye after that performance today"], ["what kind of redditor do you hate the most?", "Mega mods. No one man should have all that power."], ["where would you travel to if money wasn't a question?", "I would visit the places I have yet to visit in my country, then go to Australia, then to Indonesia, then to Thailand and finally to Greece."], ["how do you politely turn down unwanted gifts?", "If they already bought it, there’s no way. You’re going to make them feel bad for rejecting something they’ve spent their time, money, and sentiment on.\n\n\n\nIf they’ve yet to buy it, gently suggest that you do not have enough room for gifts, but appreciate the sentiment."], ["what is your age?", "Not today info farming bot!"], ["if you could fix a single one of humanity's problems, what would you fix?", "Using earth's resources, including labor force, fairly & sustainably"], ["what if people w schizophrenia are actually hearing real things and they are demons or possession, but no one believes them like in the movies?", "I had a family member with this. They were not talking to higher powers"], ["what do you think about ex step siblings dating?", "Are you blood related? No? Then who gives a fuck"], ["what if people schizophrenia are actually hearing real things and they are demons or possession, but no one believes them like in the movies?", "Well, the movies depict schizophrenia"], ["what movie do you desperately wish had a sequel?", "I wanna see another Predator movie with Arnold Schwarzenegger."], ["what movies you loved so much that you said f streaming and purchased?", "The Zack Snyder version of Justice League"], ["whats a skill you have that most people would consider useless but you find helpful?", "I can my whole hand inside a pringles can"], ["tsa agents of reddit, what is the strangest thing you've seen in someone's luggage?", "I am not one but I can tell you, exploded mango"], ["what made you cut contact with a sibling?", "I’ll win this one probably. They shot and killed their own dogs in their own backyard in front of their own kids because the dogs escaped their shitty fence and attacked a neighbors chicken"], ["what’s your love language?", "Receiving? Physical. Giving? Food and comfort"], ["what's your non-negotiable when looking for a partner?", "The only penis in the relationship is mine"], ["what was your “something has to change” moment? what happened?", "So i was the fat kid in primary and the 1st year of secondary school. But during the summer I started working out, with my dad and lost alot of weight.\n\nFull on 1st day of high school no one recognised me but they thing that really showd me this, was that i talked to my best friend for 10 minutes, and she didn't know it was me, until i used her nickname."], ["what were the first signs/symptoms you experienced before being diagnosed with cancer?", "Blood in my urine and urgency, as in if I felt that I needed to go pee then I had to go right away because I couldn’t hold it in."], ["what was your favorite experience at work?", "I used to work for a Nonprofit that had a partnership with an NFL franchise. We held camps for underprivileged children in the summer and one time a well known NFL player happened to be shooting a commercial on our field. The kids were separated by a gated playground, but that didn’t stop them from cheering and chanting his name. He waved, and then the kids almost in unison asked if he would come play with them. He asked them if he could come when he was finished and sure enough, once the shoot was over he made a beeline to the playground and hung out with them for a few minutes."], ["what is the prime example of \"one isn't enough, but two is too many\"?", "As someone who didn't become a parent until I was 35...kids"], ["people of reddit what’s your fav subreddit?", "R/megadeth just because im a fan"], ["what’s been the most disappointing part about being an adult compared to your expectations as a kid?", "All the \"adulting\" that seemed so automatic for adults is actually a lot of work and a big pain in the ass!"], ["if you're 30+, what makes you feel this is peak of maturity?", "There is a few level ups from there that are not required. A job with life and death consequences, a managerial leadership position that also has decisions that affect entire careers besides your open or owning a business similarly with employees. Having children."], ["what is the most perfectly casted movie?", "The Lord of the Rings Trilogy."], ["what is the biggest misconception about your country or culture ?", "Not all British people have terrible teeth"], ["if you're white, and immigrated to the united states from africa, do you identify as african american on applications and forms? why or why not?", "No because African Americans are Americans with ancestry from one of the Black racial groups in Africa"], ["what movies would still be good even if someone spoiled the ending before watching?", "Interstellar, well sort of. My dad accidentally told me one of the twists and it almost ruined it for me, but the movie it self was amazing and I was very pleased dispite having a bit of it spoiled for me."], ["which movie do you believe is the best ever?", "The new Dune is up there. Not sure if you can say the best but close for me."], ["what to do to get long hair quickly?", "Scalp someone with long hair and crazy glue it on."], ["when was the last time you hung out with friends?", "I don’t think I ever have even when I had friends in high school."], ["what has increased in price way too much beyond groceries and rent?", "I remember that time when PlayStation plus was free & Blockbuster was open"], ["in your opinion, is there a minimum number of times that something has to happen before you can say it “usually happens? what’s your thought process?", "For context, I got into a debate with my friend about this. The baseline definition for “usually” in my head is “it has happened a majority of the times it could have happened”. But suppose something could have happened twice and it has happened both times. That would technically fit the definition of “majority of times” but my intuition is that saying it “usually” happens implies that it has happened more than twice. Obviously “usually” is supposed to be a relative term, but how relative exactly are we talking? Saying something happens “usually” if it’s happened two out of three possible times makes WAY more sense to me but even then it feels a little odd. Does anyone else have an opinion on this?"], ["what's a habit or behavior you have that you wish the opposite sex would adopt more often?", "I wish men would wear long black jackets more"], ["if you could know the inner thoughts of any single person, who would it be?", "My significant other , just imagine the peace after understanding what she actually fucking means / wants ..."], ["for those who have relapsed on alcohol before, what has motivated you to really stay sober?", "It only takes deeply losing yourself to an addiction once to have all the motivations in the world to quit. Waiting for the motivation to do something is a mental trap, though, whether talking about quitting drinking or starting working out, the real motivation comes after you've worked hard for something you don't want to lose."], ["what would you do with 25,000 dollars?", "Put them in my bank account with the rest of my savings. Getting older. I need that money soon."], ["if you could have any animal as a personal assistant, which animal would you choose and what tasks would you have them do?", "A bodyguard grizzlybear ..."], ["what is something your parents did growing up that was stingy to save money?", "There was a time period in my childhood when my dad decided that he wasn’t going to pay the city for trash collection any more. We would run around with small bags of garbage in our truck and toss them out in public trash cans (e.g. McDonald’s, Walmart, etc.)"], ["what regular chore do you do that someone born into families with millions or billions to their name likely wouldn't know how to do?", "Laundry.\n\nI knew a guy in college who's the son of a business mogul. University was a 6 hour flight away from home. During the school year, he didn't do any laundry. Everything went to the dry cleaners."], ["people who are long term knuckle crackers how are your hands after 10 years?", "Unaffected by knuckle cracking, though mom still hates me for it."], ["what is a word that is difficult to physically write legibly and quickly?", "~~consisusness~~\n\nConsciousness"], ["what is the best response to someone knocking on the door of the public bathroom your in?", "I'd say lay on the floor and make a snow angel."], ["what are the possible cause when pc just keeps on restarting?", "Try over on /r/pchelp"], ["how do you cure halitosis?", "Have you seen a dentist? And who diagnosed you with this?"], ["what was your “i’m too old for this,” moment?", "Most internet drama I come across."], ["what the best way to avoid fatigue during the physical exertion ?", "Tell her to get on top and take over 😉"], ["how would you feel about a law requiring companies to display their lowest and highest employee salaries on all job postings?", "I don’t think a law like that would ever be passed, and I doubt it would be legal, but it would definitely be interesting information."], ["what would happen to society if death were seen as a transition to another form of existence, and not as the end of life?", "Most major religions do already believe that. What do you think heaven is for Christians or Jannah is for Muslims?"], ["dmv workers of reddit, why?", "I don’t work there, but…. \n   \nIf your question is “why do you work there?” The answer is that it’s a government job, which means steady work, job security, good benefits, and lots of holidays. I don’t know what it pays but I’m betting it’s not too shabby.  \n  \nIf your question is “why is there so much red tape/inconvenience/bullshit?”, that’s not the fault of the person taking your photo for your driver’s license or the person asking for these forms to be filled out. That’s the fault of government bureaucracy, and no amount of you bitching at them is going to change that. The lady behind the counter might even agree with you that it’s overdone, but if she lets you slide without dotting all the I’s and crossing all the t’s, she could very well lose her job.   \n  \nIf your question is “why are you so grumpy/bitchy/anal about everything?”, my guess is that’s a twofold answer.   \n  \nFirst, because of the aforementioned bureaucracy. Somewhere there is a boss who has a boss who has a boss who will freak the fuck out if she gives you the purple form instead of the yellow form.   \n  \nAnd second, because the people on the other side of the counter are wearing her down with their complaints about said bureaucracy, about their excuses not to have the forms filled out, about how unfair it is that the cops took their license when all they did was drive 90mph drunk in a school zone, about how they are sick of this shit and she’s a stupid bitch and she’d better hope she doesn’t run into them out in public because they will kick her ass.  \n  \nSo my question is this: People who give workers at the DMV a hard time, why?"], ["what old profession needs to make a comeback?", "Cobbler. Better quality shoes that can be repaired again and again."], ["what “secret sauce” do you keep from the people in your life that you will gladly share with redditors?", "Quinky Sauce:\n\n* 3 parts ketchup\n* 2 parts soya sauce\n* 2 parts mustard\n\nIt goes great on burgers."], ["what's a common misconception people have about your profession or field of study?", "I’ve shot reality tv for 15 years. Common misconception is that it’s all scripted and they’re acting. Truth is they are horrible actors and it really shows when producers try to feed them lines. There is a certain amount of set up, but for the most part it’s really playing out naturally, we shoot a ton of footage and only a small percentage of it makes air. The best momenta are the ones nobody saw coming."], ["long-time teachers of reddit, what are your experiences with gen alpha kids vs gen z kids?", "They're just kids. \n\n\nNo matter what happens in life culturally kids are just kids. 1980s kid is doing the same shit a kid in 2010 year old kid is doing.  Is exactly the same shit Egypt, China and Rome were dealing with with their children."], ["how did you find out you've cancer?", "That’s a scary question"], ["what would the world look like if people lost the ability to speak and communicate only through thoughts?", "Oh fuck, my adhd will be a brown note toward everyone"], ["what’s the most outrageous, ridiculous, crazy thing someone has ever said to you?", "That I’m a zero and I have no redeeming qualities whatsoever."], ["in your opinion, what famous or not famous person should have been punished for their crimes but got away?", "James Corden for crimes against comedy."], ["what is the thing that you do not want the children to take from you??", "Mentally: My shitty math skills\n\nPhysically: My height"], ["what's a food that you hated as a child but love now?", "Mmmm roasted onions. Like borderline burnt. They're like candy."], ["what actress has the best smile?", "Dahyun from Twice. Not an actress but Google her smile"], ["what movie villain did you find more endearing than the hero/protagonist?", "Heath Ledger's Joker in The Dark Knight. \\*chef's kiss\\*"], ["what’s your favorite inspirational quote from a movie?", "There is no normal life. There’s just life. Get on with it."], ["how does one get the job at ashleys furniture?", "Apply, do well, let the company exploit you"], ["what degree of 'living with it' do you think is considered normal for aches and pains in western society?", "Living with pain is considered normal if it is mild and can be managed with medication and treatment"], ["when did you find out the grass wasn't greener, in whatever it was?", "When the field was full of dead grass"], ["what is the best part of your daily routine?", "Relaxing with no pants at home"], ["what’s a conspiracy theory that you actually believe might be true?", "the god damn moon landing, i have a sneaking suspicion it mightve happened"], ["how do you guys control and diffuse your anger for anything ?", "You can distract yourself by focusing of what you hear around you, see in your periphery and feel under your feet\n\nThe reason you're angry is pretty key to how u talk yourself down tho, I can give a better answer if u give an example"], ["what was that moment that you hurt someone by an accident?", "Well, it was when I shot my 45 straight up in the air. The terminal velocity of the bullet on its descent was enough to kill my favorite cousin when it hit her in the head."], ["what's a cultural tradition from your country that you think would the world would benefit from adopting?", "giving each other the finger"], ["how would you describe yourself in a few short words & how would your friends describe you?", "I am generous coz I know how it feels to have nothing. They also described me as a giver coz I often offer them something they can use and food to eat."], ["what’s a favorite show of yours that got cancelled, that makes you wonder why the writers don’t just say what they were planning to do, just to give their fans closure?", "Mine is definitely Stargate Universe, it was just getting really good! \n\nFollowed by all of the side content cut from the cancellation of The Owl House"], ["be honest, how has reddit influenced your views on life/politics/etc. ?", "None, i hate the opinions on here most of the time, and reddit hates my opinions"], ["top 3 shows of all time?", "Hill Street Blues\n\nLaw & Order (original)\n\nMASH"], ["what's your favourite movie scene of all time?", "Alan Grant seeing the Brachiosaurus for the first time."], ["\"lwhat are some of the most mind-blowing thriller books you've ever read, and what made them unforgettable?", "At the Mountains of Madness by H.P Lovecraft. *(scifi-horror/thriller)*\n\nIt was unique and very ahead of its time. A very exciting read. \n\nGuillermo Del Toro has planned on making a movie about this novella for years, and actually started making it, but hasn't been able to finish production due to issues, but still says some day he will because he loves it so much and wants there to be a good film for it. \n\nHopefully one day, we will see it 🙏"], ["when a presidential candidate visits a town, do ticket sales go to their campaign funds or go to the event location? or both?", "Friend of mine is buying tickets, and urging others to do the same, to a candidate’s upcoming rally with the intention of leaving those seats empty, but are they still contributing to their campaign?"], ["what’s a common societal expectation that’s completely unfair?", "perfection. It’s only attainable by erasing mistakes"], ["what is the most ridiculous plot line that you have ever seen in a movie or tv show?", "Friends - Expensive apartment you have there."], ["what’s your favorite generic med name?", "Mine is “bisoprolol”, it just sounds right"], ["how come most modern-day music is done in 4/4 or 2/4 time, and not 3/4 or other timings?", "Every drummer learns 4/4 first. Only those jazz guys learn odd time signatures. 😂"], ["who do you think would win in a fight robert mccall or john wick? and why?", "I don’t know who the other guy is but doesn’t matter, John Wick wins"], ["what should replace breakdancing in the olympics?", "If it has to be dance related: jerking or Memphis Jookin"], ["what is your favorite thing to do?", "Nap (from teens/20s/30s etc to now)"], ["what tasks are you ready to delegate to ai agents?", "None of them. Not reliable enough"], ["how do u feel about the religious wars that occurred across the times?", "I think people who say religion should be outlawed are cringe"], ["if you were to explain what a dream is, how would you describe it?", "Your imagination gone wild."], ["who wins the olympics?  most golds or most medals?", "I think assigning a point value to each medal and then add them to get a total score. 3 points for gold, 2 for silver & 1 for bronze.  This way a country who wins 3 silver & 1 bronze, comes ahead of a country who gets 2 gold."], ["introverts of reddit. who is the one person you can spend the entire day with and not be tired of them?", "My wife… accompanied by my dogs. Final answer!"], ["what’s your least favorite thing on your daily routine?", "Being responsible. I just want to relax and do nothing for like a couple years but bills and shit I guess."], ["if you could change one thing about reddit what would it be?", "The ability to delete subreddits that you've made."], ["what is the most white trash behavior?", "Can’t pay rent on time but always have cigarettes/booze."], ["favorite all time game? and what platform?", "RDR2 - PS4\n\nSix years later, still playing and discovering new things"], ["what is a good tv show or movie to watch?", "If you like horror, then the Haunting of Hill House is incredible. If you like weird cringe comedy then Pen15 is so oddly hilarious."], ["what is your favorite drink?", "A moscow mule is always good if made correctly. Very refreshing"], ["why do you create throw away accounts on reddit when you can delete your post easily?", "One time I deleted a post, and some other guy recreated it. Never underestimate the pettiness of a basement-dweller."], ["what's your favorite anime/manga? and for what reason?", "Blame! is my favorite Manga, I just really love the art style and the vibe of the world Tsutomu Nihei creates"], ["what do your friends and/or family make fun of you for?", "Why do I have the feeling you all are the ones getting made fun of alot"], ["whats something you wish people understood more about you but?", "my chronic Migraines, Most people don't understand how debilitating they really can be."], ["what movie scene and or quote will never fail at making a gen xer or elder millennial cry?", "It has to be Marley and Me. When he has to put him down... someone is always cutting onions when I'm watching that scene."], ["what is the going bribery rate for minor offences in your country? can your police be bribed at all?", "Where I’m from you can’t pass a driving test without bribing the police officer"], ["people always think “times are tough”, but when were the actual toughest times in the last 300 years?", "There have been several active war zones and genocides in the past 300 years so like... those."], ["what do you think the funniest olympic sport is?", "Power walking. Even the athletes must know it is ridiculous, right?"], ["what makes people who are in a relationship flirt with people they are not in a relationship with?", "What if they're not flirting and the other person just thinks they are? lol"], ["what belief or opinion you held for a long time that you later realized was completely wrong?", "I once thought Elon Musk was not a supervillain."], ["who was your movie or tv crush as a kid?", "Lacey Chabert and Neve Campbell"], ["what is the stupidest thing you've ever done, that you still regret to this very day?", "One night on my friends birthday several decades ago we got drunk drove around in a four-door massive Cadillac we were riding on the roof as my buddy drove the car destroying all kinds of landscaping in whatever we could target in people's yards cringe cringe cringe I'm sorry everybody\nThanks I think this is the first time I've ever regretted it I mean mentioned it voice to text so forgive"], ["what was the sadest death?", "Probably when Darth Vader killed Anakin."], ["which celebrity do you think can pull of a bowl cut and looks sexy in it?", "Henry Cavil cause he’s sexy no matter what"], ["[serious] which movies should never be remade?", "Back To The Future .. I, II & III. Seriously best movies/trilogy I have ever watched"], ["those who learned english as a 2nd language, before learning it, what were your thoughts on the english language? and why you start learning it?", "I started learning as a kid, family wanted me to learn as we were going to different countries visiting relatives etc. Well, they also thought it's important to learn at a young age, that too.\n\n\n> what were your thoughts on the English language?\n\n\nNothing much, just matching sounds to letters was a struggle at first as a child. Sometimes I would hear something, but the spelling of that thing would be different. I still struggle with spelling sometimes 😅"], ["be honest, how often do you fart in public?", "All the time, but I burp more."], ["what are some side hustles that helps you pay rent ?", "If you WFH, online customer service is a thing."], ["your neighbor to the right of you challenges you to a duel, who is winning?", "Me. I've got all five pieces of Exodia, and my neighbor has never even played Yugioh."], ["what is the worst thing you ever heard someone say about another person?", "It was Said to me, you are noth worthy of love and happiness. You are too ugly and too fat and too wierd and you will die alone and no one would care😔\nStill remember those words"], ["what movie can you rate 10/10 ?", "The Green Mile. Ex Machina."], ["rich people, what’s the secret to building wealth?", "College, Corporate Ladder, and Investments\n\nDont fall for the get rich quick schemes and influencers who spread lies to gain views"], ["what’s your opinion on being jinxed?", "It’s basically a placebo effect"], ["what is the best way that you have moved a mattress and some other small items to a new location while moving?", "I rented a truck for the day."], ["when's the last time you had the hiccups?", "I'm also **hic** wondering what **hic** you did to stop them\n\n**Hic**"], ["what physical sensations, if any, do you experience when you see someone get injured?", "I've asked a few people and haven't yet found anyone who gets an electric kind of tingling pain in the back of their knees, as I do. Is that a thing? It's very uncomfortable."], ["what is a mushroom you'd recommend to someone who doesn't like mushrooms, but wants to give them another try?", "Shitake mushrooms have a more firm texture and almost taste like meat.\n\nDice them up finely in something and you could trick someone into thinking something has meat in it."], ["what else happened to you when you had covid?", "I had 104 fever for about 4 days.  Ever since I’ve had neuropathy and a severe headache."], ["what’s the most amount of cigarettes you’ve smoked at once? what happened after that?", "I remember smoking 55 and throwing away the rest after it. I was sober, my mouth felt like I had eaten burnt charcoal or inhaled smoke through it. \n\nI was in a bad place in my life. I usually lose count when I drink, would easily do 15-20 smokes at the very least, this was different I was sober and angry. \n\nDidn’t touch any smokes for the next couple of days, maybe out of guilt and shame towards what I did to my body. \n\nSadly, I was back at my usual 5-10 smokes a day soon. I eventually brought it down to 1 a day in two years after this incident. It took me 8 years from then to completely quit.  \n\nIt’s definitely one of the worst things i did to myself. I had to add this, if I went back in time, I’d tell myself no amount of stress, no matter what the problem may be, smoking isn’t worth it. Can’t get into more details, unwilling to share. Thanks"], ["what to do when you’re stuck at the airport for 12 hours?", "Get a hotel room at whatever hotel has a shuttle and is close, grab a bite to eat, get some sleep, and take a shower before your flight."], ["why did reddit get rid of the \"misinformation\" option for reporting posts? how could this possibly benefit the culture of the site?", "It’s still an option for this sub…"], ["what's a movie or show you watched that was so bad it was good?", "Rubber (2010)! We watched it in high school and we thought it was so stupid. It’s about a car tire that wants to kill earth hahaha"], ["what’s the grossest thing you’ve done in your office?", "Trust a fart and shit my pants"], ["what is the funniest joke, no holds barred, you've ever been told?", "Separate by equal is a good thing...\n\n...for eyebrows.\n\n-Demetri Martin"], ["what motivates you to complete a task?", "Unless it's a task I genuinely enjoy, my primary motivation comes from the satisfaction of being able to cross it off my \"to-do\" list. \n\nFor everything else, I rely on the following mantra: \"Once I've started/Now that I've started, I'm bound to finish at some point.\"\n\nWhich helps me keep going and get through some of the more mundane or less enjoyable tasks."], ["what's the worst thing you can do while also on lsd?", "Go to a family reunion, particularly your own family’s reunion."], ["what was the first movie you saw in theaters?", "I think ninja turtles or home alone? Which one came out first?"], ["who has been the villain of the olympics this year and why?", "Probably that Dutch volleyball player who is a convicted child  rapist"], ["what obvious things  do many people not know?", "All doctors are greedy on some level."], ["if you only had 5 minutes to live, what advice would you give?", "Live in the moment as much as you can. When working on a large project, try to ensure it has use for someone other then yourself."], ["which one food sabotages your diet every. single. time?", "I can't buy tubs of ice cream because I'll finish it all within 2-3 days - I only buy the individually wrapped kinds now."], ["if life were discovered to be a simulation then what would the illusion of free will do to you?", "If we discovered that were were in a simulation, it wouldn't change anything really. The simulation would still be our reality and we couldn't escape from it. \n\nAnd as far as free will goes, it seems like free will is already an illusion regardless of whether we are in a simulation. Because any choice you make was something that your subconscious chose to do before the rest of you was aware of making the choice. And this has been tested and studied to the point that your brain can be scanned and a computer can predict your choices before you think you make them."], ["was there ever time you were right, and everyone else was wrong? how did it play out and what was it?", "Basically every opinion I have."], ["what's your advice for redditors that are really mad at you rn?", "Get over it. We are complete strangers that will probably never meet in real life."], ["what is the dumbest lie you ever told?", "I know what I am doing."], ["do you judge people that are obsessed with a tv show/movie ect and why?", "No, as long as they don’t get parasocial and think the actors are their characters and send them threats or stalk them."], ["what advice would you give someone that can't \"let go\"?", "Make new experiences. \n\nThat's what a psychiatrist told me once. \n\nWhen you can't let go it's usually because you refuse to \"move on\". \n\nSo, whatever it is you can't let go of - make new experiences, new memories, new things to worry about."], ["what's something about you that always seems to surprise everyone?", "Well seeing as every guy I've met through tinder is surprised that I'm actually 6ft tall, even though it says right there in the bio, that."], ["what’s something only rich people worry about?", "becoming poor. \n \npoor people don't got that issue."], ["men: what are your tips to last longer during sex?", "Baseball. Cold showers. Margaret Thatcher naked on a cold day"], ["what thing did you used to possess or own that you no longer do and really miss?", "My motorcycle. \n\nBut more than that, my youth."], ["where are the windmills in texas that you can see in the dark for a thousand miles?", "that's impossible. for a 6 foot tall person to see the top of something 1,000 miles away, that thing would have to be give or take 1,800 feet tall which is more than twice the height of the words tallest wind structure"], ["which year cranked out the most banger movies?", "I'd say 94. You had Shawshank redemption, pulp fiction, forest gump, lion king, the mask, mighty ducks 2, the crow, Leon the professional, the flintstones, ms.doubtfire, clear and present danger, true lies, speed and the santa clause."], ["what was the funniest reason you were kicked out of a store?", "I got kicked out for trying on too many hats and making a mess of the display."], ["the 1900 century had the roaring 20s, while the 2000s are having the raging 20s. what is your story of rage on display?", "I know a business owner that has had four of his trucks totalled by idiots on the road in the last eight months. He has dash cam footage of all of the accidents."], ["how often do you exfoliate your skin?", "Body skin, literally never. Use retinol on my face but never scrubs or anything. You probably just don’t need to exfoliate much or at all. People way over exfoliate"], ["if you are one of those people that steal people's lunch at work, why do you do it?", "I'm so curious as well, commenting to follow along!"], ["what is the most interesting or surprising cultural difference you've encountered while managing or working with remote teams from different countries?", "As someone who has had the opportunity to work with or manage diverse teams across various cultures, I'm curious to hear about the unique challenges, insights, or memorable moments you've experienced. How did these differences shape your approach to collaboration and communication? Any particular stories that stand out?\n\nFor me, one of the challenges has been balancing people who are very direct in their communication with others who are less direct. Understanding these differences early on has been crucial in preventing bigger issues down the line. I'd love to hear how others have navigated similar situations!"], ["what is actually considered as too much sodium a day per grams?", "3500 mg daily is too much."], ["what was the dumbest question that you have been asked ?", " Do you live in an igloo or teepee?\n\n Yeah. I’m sitting here with my laptop in my igloo, you dipshit."], ["what movie had you watched only once, but one scene cringe so hard it burns a memory in your brain forever?", "men in black 3 makeout scene.\nonly of the trilogy I don't like primarily just because it made me uncomfortable"], ["what’s a fashion trend from your youth that you secretly miss?", "Puka shell necklace. I grew up in Florida"], ["vapers of reddit, what made you decide to quit or not quit?", "i quit at one point bc i had to get my wisdom teeth out, but i started again because addiction runs in my family and i would rather be addicted to vaping than weed/ alcohol/ heavy heavy drugs. i'll stop again at some point ik it affects my health"], ["what is a book or movie that you believe is underrated, and why do you think it deserves more attention?", "Badass by Ben Thompson"], ["have you ever had someone point a gun at you? if so, what happened?", "Yes....can't tell. \n\n\nThank you for coming to my Ted Talk."], ["what are some small changes you've made in your daily routine that have had a surprisingly big impact on your productivity or happiness?", "Honestly, not daily but nightly better sleep. Makes a massive difference in every aspect of life."], ["what's your advice for humans that are always in a bad mood?", "You’re only hurting yourself. Be kinder to yourself. Remove what pisses you off from your life and if you can’t, surround yourself with as much positivity as you can."], ["what's the worst thing you've done to a friend?", "Prank them super hard then say it’s just a prank bro"], ["what is the most weird/wackiest/most absurd political party you have found on wikipedia?", "British Columbia Party of Citizens Who Have Decided To Think For Ourselves & Be Our Own Politicians"], ["what if everyone in the world is immortal?", "Not gonna work.  There can be only one."], ["what to do during summer?", "I'm out drinking feeling good"], ["how can one loose their mind if they don’t have one?", "What device or setting changes lose to loose? It’s like some epidemic. Anywho, let’s do a lesson on figurative vs. literal."], ["people who believe in cryptozoology, what is your favorite cryptid?", "I wouldn't say I believe in it or suggest they're real, but like reading about different examples. My favourite is probably the \"J'Ba Fofi\" which are giant spiders rumoured to be in the Congo. If I remember rightly, it's been stated that it's physically impossible for spiders to grow so big but still, it's crazy to think about"], ["if you can live your life like a movie, which one would that be?", "\"Limitless.\" I discovered Adderall, MDMA and theanine and felt limitless. I'm excited about nootropics."], ["what language is this please?", "Looks Russian. It says Атмосфера благополучия"], ["who is the luckiest person alive?", "my old science teacher said there was about a 1 in 400,000,000,000 chance of a baby being born so everyone on this planet is EXTREMELY lucky"], ["what is/was the peak of humanity?", "Genghis Khan  populated the Earth....."], ["what are your favorite packed lunches for your kiddos or yourself?", "Overnight oats for breakfast and a salad/sandwich for lunch"], ["if you were a song, what would that song be called? who would sing it?", "Please please please let me get what I want"], ["guys, what is something that you did years ago that you are still frustrated about?", "I will start: I turned aggressive towards my cousin 3 years ago and as a consequence I was kicked out of the house and they never want to have contact with me ever again."], ["when was the last time the temperature in celsius matched your age?", "Not long ago, 24C is pretty typical summer temps where i live"], ["what’s the worst thing you can get away with?", "Ethical Considerations"], ["what are some jobs that have a wfh element as well as a practical element?", "I'm retired I'm a vet"], ["people who have made instrumentals, how hard is it for someone who never had done it before?", "Understanding Musical Structure"], ["how do you identify what's holding you back?", "Generalize. It’s useless, because you can’t address a general thing, but you won’t miss it in your description."], ["what is a fun fact that is uncommon in your country?", "Canada has the #10 ranked island in the world (Cape Breton Island) on its east coast. It's also #1 in North America."], ["father's and daughters of reddit, what pet nicknames do you give your daughters?", "My boyfriend calls his daughter Mischief or Chaos."], ["what’s something that really turns you on?", "Guys with super loud cars who Rev their engines unnecessarily, super hot, not at all annoying"], ["what people have you encountered whose real names sound like adult film star names?", "We have 2 ex MPs called Ed Balls and Vince Cable"], ["what app or future an app would you want to have to make your life easier?", "Automated Task Management"], ["what successful idea did a lot of damage in retrospect?", "Asbestos is suspected to have caused some injuries. "], ["what is an unsolved mystery that still haunts you?", "Someone ate my Twinkie in high school. It’s been 30 years and the person still hasn’t been found."], ["if green tea and coffee was a person who would win in a fight!?", "Coffee. I have never seen an unhinged green tea drinker."], ["what's some common sense that's isn't really common?", "Letting people off buses/trains/underground trains first before boarding."], ["how do you practice good self care after a breakup?", "Engage in Activities You Enjoy"], ["people who live in the middle of nowhere, what do you do for fun?", "Dig holes with my tractor."], ["reddit, what is something small that always makes your day better?", "Small amounts on money."], ["what's your opinion on nicholas cage?", "He’s somehow simultaneously the best and worst actor of the last 30 years"], ["who do you think is? more cute arda  or yamll?", "yamil\n\nwtf are we talking about?"], ["what is the one memory that would keep you up at night (good or bad)?", "How the only friend I have ever had (I'm 32 years old) disappeared, and I'm probably the reason why"], ["what’s the craziest thing that happened to you ?", "My whole life until now"], ["what truly makes you happy?", "Farming reddit karma."], ["what could be the cause behind a like button pressing itself on a youtube video?", "That's just a bug. It's happened to me. If you go thru your liked videos often there's one or two you've never heard of and would never like. It's pretty common"], ["what is the best way you have found of coping with being unhappy?", "Reading angst novels that allows me to let out tears more comfortably ✨"], ["what is a dream you've let go of and why?", "NBA player. Not good enough"], ["what is the worst thing that you have ever done to an ai?", "never met allen iverson but id be respectful 💯"], ["whats the craziest thing your ex has done?", "stalk me for 2 years and post in his stories how he misses me ... this is so sick"], ["what’s your mcdonald’s order?", "I only go once a year, for a shamrock shake"], ["who is someone you consider to be a legend?", "Sean Lock, Shane Warne, Billy Connolly, Patrick Stewart, Stephen Fry, Bob Mortimer, David Attenborough"], ["if you had the money left over. what surgery would you have that could improve your life?", "Sterilization surgery"], ["which tool you could get at home depot do you think would be the best weapon?", "There is only one right answer: chainsaw"], ["what are some signs that show you're self confident?", "For me, eating in a restaurant by myself and enjoying the quietness."], ["women, what is a surprising fact you discovered about men?", "That they are men and never seriously think like: \"it would be nice to be a woman\", I used to think it was a normal thought until eh... yes..."], ["what's one thing you would tell your future self?", "Nothing, he already knows what I know. Wondering what they would tell me"], ["what’s a dated mindset we need to move on from?", "Men don’t value women. Never been true but regurgitated even to this day in one form or another."], ["if a motorcyclist stops at an all way red light for pedestrians, turns off the bike, and walks it across the intersection before starting the bike up and riding off, is that legal? why or why not?", "No. If he uses a pedestrian zone as a path towards the other side of the intersection then he/she is committing an illegal manoeuvre.  Really we'd have to see the roads and intersection being used by the biker before making an accurate assessment."], ["what will you do if you know that tomorrow is apocalypse?", "probably cum for one last time"], ["what are some sugar free drink options with no aspartame that you drink?", "simply Lemon, simply orange, etc"], ["who’s your paris olympics crush?", "The French pole vaulter."], ["what sports should be added to or deleted from the olympics?", "Basketball.\n\nWow, what a shock. Team USA won gold, *again*."], ["adults over the age of thirty, what advice would you give to someone in their 20’s?", "Think about the future, its easy to sabotage your 30's and beyond by living for the moment. You may not know all the answers now, but get some goals and make daily progress towards them. You have the most energy you are ever going to have in your 20's, so make the most of it as far as work and building relationships go."], ["what does the \"pursuit of happiness\" mean to you?", "Being in the present moment."], ["what’s on your mind?", "When will this headache move on, 😅."], ["what movie do you think is the most overrated?", "Joker (2019) Can’t understand the hype with this movie, i thought it was garbage."], ["weird question but when it rains do you guys think of it as space or as time? like did you enter rain space or did rain time happen?", "Can I buy some mushrooms"], ["what is the worst thing someone has said to you while trying to help?", "Hij weet het verschil niet tussen dank u en sorry"], ["what do you have when you know you need to eat something but aren’t hungry at all?", "Leftovers or a microwave burrito."], ["how would society change if everyone could hear each others thoughts for one hour a day?", "You would know for certain if someone was hitting on you."], ["what's one movie you hated as a kid but appreciated later in life?", "Basically all the Star Trek movies that were actually good."], ["what’s your favorite dessert to eat ?", "I will always say yes to cheesecake"], ["what was the haircut that changed your life completely (something like the burnt toast theory excluding the bad things)?", "My own haircut in middle school… I was bored and let my friend cut my hair. I ended up with a mushroom top basically. Like a bob but ever shorter. I looked like a little lad who loved berries and cream. Ruined my life for the longest until it grew back lol"], ["what’s a spin-off that you consider better than the original show?", "Daria >>> Beavis and Butt-Head"], ["if you could be any animal for a day, what would it be?", "Eagle. Try flying for a bit. Check out the scenery from a new perspective. Have some salmon sushi. Sounds like a pretty great day."], ["what would you do if you became all powerful for a day? and why?", "The snap.  But more focused.  Instead of random, arrange it by personal wealth, starting at the top.  The top 50% of global wealth holders, gone."], ["what's the dirtiest joke you know?", "Why don’t scientists trust atoms?\n\nBecause they make up everything!"], ["what’s your favorite tv show?", "hannibal. beautiful metaphors and cinematography"], ["what are some apps that you would pay for?", "YouTube, paying for premium makes the site so much better. The ads are out of control."], ["men of reddit, what’s the deal with your friends pursuing a girl you like?", "To answer those who asked why, I just thought there would be a loyalty there if you knew your friend liked the girl but good to know"], ["question for those who identify as hindu: what do you feel often gets misconstrued about hinduism, and what do you wish christians knew about hinduism?", "I am Christian but find Hinduism so fascinating, the Hare Krishna belief in paticular, I have been to their main temple in England many times, lovely people."], ["what are some (metaphorical) lenses through which you've *intentionally* chosen to see (or not see) the world (after purposefully weighing the alternatives)?", "The first that comes to mind, for me, is choosing not to view the world through the Marxist lenses of interpreting *everyone's* intentions through a power dynamic. I just think there are so many other motivators to consider."], ["why are you not winning ?", "Because I'm a filthy casual."], ["who would you say are the most successful people in life that aren't categorized by their wealth and why?", "A high school buddy of mine had a thing for marching band.  He's now the band director at the high school we attended.  He's not rich, but he's doing exactly whst he wanted and is the happiest person I know."], ["as an older sibling, do you have an urge to always tell your younger sibling what to do?", "I'll answer on behalf of my older brother - yes"], ["what is something people get better at while drunk?", "talking other languages"], ["how do you prepare yourself for  purchasing a new car? what do you have to have together financially, for a loan/down payment, possible trade, intelligent negotiation, etc.?", "Do research on what makes, models, etc. I might want and what would best for my needs. That depends entirely on your situation."], ["people who noticed lumps or dents in their heads under their hair and subsequently shaved their heads, how noticeable were the lumps or dents?", "Head shape is very very noticeable if you have your head shaved or even very short. I have a scar on my head from a childhood accident. Never really thought about it until one time. I buzzed my head to about 1/4 inch and you could very clearly see the line down the center of my head."], ["when was your favorite moment in your whole life?", "I have 3. The moment my babies were placed in my arms"], ["what's a place you've been to that you would recommend?", "Red Cow, on Selby Ave in St Paul, MN. Food is fantastic, and it's a lovely setting. Go on a good weather day and you can have a spot outside!"], ["what are red flags you ignore?", "When conversations and meet-ups are always initiated by you and never by them. One sided relationships suck."], ["if you could teleport yourself into any tv show, which show and why?", "Post scarcity, high tech Star Trek TNG ...for reasons that should be obvious."], ["reddit, what is a word in your language that sounds like a complete different word in english?", "French for seal (phoque) is pretty much pronounced the same way as fuck."], ["those who graduated with a ~2.0 gpa, what are you doing now?", "10 to watch 15 to touch."], ["for generations listening to this years from now, is there any wisdom you’d want to pass on to them? what would you want them to know?", "If you wanna get fucked in the ass, then try it."], ["if you coud have an ai companian in human form that could assist you with anything, how would it change your daily life?", "I need a fully automatic self loading air fryer in my fridge"], ["what is a movie that you think is bad, but most people think is good?", "For me it's the (by clicking on the spoiler you agree to not leave any angry comments)>!the barbie movie, it's very overrated.!<"], ["retail/grocery/wholesale club workers: what is the best job to have at your store? what is the worst job to have at your store?", "  Deli is the worst. It's hot, you're constantly on the go (if no customers then you're doing preslice). Stocking center store for best job."], ["what's the last thing they said to you before you became strangers?", "I’ll never forget you,’ they said as they waved goodbye, which is funny because I’m still here trying to remember where I left my keys. 😅"], ["when were you the maddest you'd ever been? what happened, and what did you do?", "I was in the car with my mom and sister and my sister kept bringing up a sore topic for me. This was the first, and only, time I have ever swore in front of my mom/sister. My mom had to pull the car over because I was about to strangle my sister. I went into the most violent fit of rage I have ever experienced in my life followed by me breaking down and crying harder than I ever have."], ["which tv characters death made you quit the show?", "Poussey Washington - Orange is the New Black. Didn't finish it until six months after the last season."], ["have you ever felt unsafe due to another person on an airplane? what is your story?", "I swore the kids behind me were ploting on tik-tok live how to hijack the plane, but I didn’t want to assume something and make an ass of myself"], ["what was a recent thing you request a full refund on because you were unsatisfied and why?", "On the game Pippa Funnel for PC, the disc and the case smelled of cigarette. Once I put it into my PC, it crashed it and setup my backup. I was fuming."], ["what is the biggest obstacle to having a balanced life for you?", "Getting out of the godforsaken city I live in and find a place where I can actually get out and do something."], ["what was the cause of the stupidest argument you've had or witnessed?", "Some guy claimed I was two or three inches shorter than I actually am. We met once at a party and were enemies/rivals on a crappy online forum."], ["what are some tips for going to college and also  for situations that'll happen in your adult life in general?", "Your first class you sign up for should be college survival or something similar"], ["how do you guys improve your verbal communication?", "Practice and trial-and-error"], ["what's your favorite article of clothing that you own?", "A leather jacket my mom used to wear when she was younger. I think it looks great!"], ["if someone from the early 1900's time traveled to present times, what would be the most hardest thing to explain to them that has changed?", "“So, women have jobs now…”"], ["what's the strangest product or service you've heard advertised for \"back to school\"?", "Guns. Saw it in a meme and people need serious help."], ["what did you like about your first ever crush?", "I'll quote a book called High Fidelity:\n\nIt's a mystery of human chemistry... but some people just feel like home."], ["which ps4 game is the best under 20euros ?", "\"The Witcher 3: Wild Hunt\""], ["what’s a job you can do while drunk or high and it won’t make you performing negatively?", "accounts payable manger. ask me how to know!"], ["whats the best question to ask in order to end convos quickly?", "That awful smell is it you?"], ["if you could be dictator of the world, what would you do and why?", "Make everyone study architecture. Yes, I am evil."], ["if you can only eat the same meal everyday for the rest of your life, what would that be?", "medium rare NY strip steak and mashed potatoes with a ton of butter 🥵"], ["who regrets having children?", "Financial Strain and Unfulfilled Expectations"], ["type one diabetics of reddit, what’s the worst thing someone’s done to you not knowing you have diabetes?", "People sometimes offer sugary snacks or desserts without knowing the individual's dietary restrictions, which can be particularly problematic if the person doesn’t have access to their insulin or other necessary supplies."], ["what the best ending for a tv series you've been watched?", "Blackadder Goes Forth when they are sent over the top"], ["which job improved you as a person the most?", "Retail was the best thing for a shy person like me. Forcing me to give great customer service really opened me up"], ["what will be the future of twitter?", "Musk seems happy to keep funding it, and he probably will."], ["you're given the power to instantly solve one global problem, but you age 1 year for every thousands lives you improve. what problem do you tackle and why?", "I will give everyone a papercut and make all band aids lemons"], ["what’s an uncomfortable statistic that people should know?", "60% of the time, it works ALL of the time."], ["what is your favourite cuisine/dishes from preferred cuisine?", "I dont know how to call it in English but germknödel"], ["at what age is someone passing away less of a tragedy?", "Never. \n\nIt’s all about how you process grief."], ["what's a song that truly goes hard?", "\"Kerosene\" by Big Black"], ["the people who have ever slept with two different people in a span of 24hrs, how did you feel?", "Good but I showered in between"], ["how do you handle difficulties in your romantic relationships?", "The best thing you can do is talk to them about it. Try not accuse or get defensive. Communication is key."], ["what's your favourite thing about the city you live?", "It's not a tourist destination."], ["what would you do if you know you have some days to live and cannot move much because you are physically sick? no one knows about it except you no one in your family. what's the plan?", "My guilty pleasure is to eat. Now with no worry about weight gain and health issues, I’ll eat and drink whatever and how much ever I want"], ["just for fun, what’s one thing you’d like to see become an olympic sport?", "Fighting ninjas after jumping off a plane with water guns mid air"], ["what age did you make the worst decisions?", "Late 30s to Early 40s (35-44)"], ["what are some ways to get over someone who is no longer in your life?", "I go outside, take a walk, exercise, watch a TV show, do some cleaning, etc. Developing a routine makes you move on from someone slowly but surely."], ["how do you handle having strong romantic feelings for just one person in a relationship?", "Distance and time\n\nIt's tough but you just have to get to a stage of acceptance"], ["what type of characters are better? original characters (arthur morgan,kratos) or custom characters (deputy from fc5,rdo/gta online character's?", "I prefer my custom Tav from Baldurs Gate 3 over playing as any character given to me, but mostly because I just prefer RPGs to any other genre."], ["who’s here loves being in a hot bath for like 15 mins followed by blasting the cold water into the tub for another 10-15 mins?", "👋 best feeling ever and also excellent for your skin. Lol."], ["uncensored english speaking comment sections online tend to be both highly combative and vulgar, how similar is this in other language comment sections?", "People who speak other languages are magically much nicer and more tolerant people than those vile English speakers"], ["what song has the most emotional message ever?", "Billie holiday - strange fruit"], ["what was the origin of the dumbest rule your school enforced?", "You weren't allowed to make finger guns, probably because of all the school shooting"], ["what's something that feels good to hear and say but it's a lie?", "\"I'm fine, and how are you?\""], ["what would you choose - the one you love or who loves you?", "Idk, let me try either of those first"], ["what show do you wish had just one more season?", "For me it is Ghosts (BBC). I feel like the premise of the final episode could be a whole season arc and made what happened at the end feel more natural."], ["ed (erectile dysfunction) is more prevalent than ever before, why? especially in young men?", "SSRI Meds for depression"], ["what is the best thing about not having friends?", "You can't be betrayed."], ["what's a health fact that seems too good to be true?", "That if you breathe, you live."], ["how many books do you read per year and what is your dominant hand?", "This is for my final project in statistics.\n\nI'm ambidextrous and I read 75 books last year, and average about 79 per year"], ["what is something you miss from being a child?", "Not having old parents who are deteriorating in front of my eyes. Not having existential depression."], ["what is the most fascinating deep-sea creature?", "Sperm whale.     Giggity"], ["what’s something from your childhood that kids today will never understand?", "Waiting for a certain time of the day to watch your favorite shows and then having to wait a whole week for a brand new episode.\n\nCan’t tell you how long it took for Namek to explode but I do know it was longer than 5 minutes.. iykyk \n\nKids these days are too privileged with access to every show whenever they want."], ["what do you believe happens once you die?", "Eternal sleep. Just like how time flies by when you sleep every night. Minus the walking up part. Or dreams."], ["what’s the most bizarre, unexplained thing you’ve ever witnessed?", "In an Airport at the bathroom was someone from the personal at the sink and washed his Penis. There were like 5 people in the bathroom and he was casually washing his dick in the sink"], ["what was the most fun date you have been on?", "High-powered go-carts.  I was having so much fun. I was laughing and could not stop!"], ["people who have had experiences partying with famous people,what’s your story?", "I got smashed with Peewee Herman. Dude can drank."], ["what are your best garage sale finds, and what's the story behind them?", "My best find was an old Coleman camp stove for $4 because the seller said it didn't work. I took it home and gave it a try and it worked perfectly. Apparently the seller didn't know how to pump it up to pressurize the white gas. \n\nAnother good find was a stack of brand new cast iron frying pans that I paid $2 each for. The people selling them had tried to make corn bread in them and it had clearly been a disaster because they weren't seasoned."], ["what are the best truth or dare questions?", "One of the best Truth or Dare questions is, \"What's the most embarrassing thing you've done in front of a crush?\" It's guaranteed to make everyone laugh and spill some juicy stories!"], ["what is something that you bought on impulse, that turned out to be a good buy?", "My platform crocs I really hate crocs they look awful the platform ones looked a little nicer and now there my go to."], ["what’s the most scariest/hunting thing you’ve ever seen in real life that you still don’t understand nor believe it happened?", "It was my 19th birthday my brother had gotton me a new watch and a ended up falling to sleep with it on. Then i got sleep paralysis, my bed room door slowly opened and this lady in all white came out. She had long ash hair, with 7 orange eye and her clothes looked like they were from the 1800s.\n\nShe stood at the edge of my bed, her hand stacked out like plastic getting close and closer to my face. I could see her hand slowly takeing up all that i could see. Then the watch went off, and i regained control of my body and i jumped out of bed.\n\nIt turns out the watch was a joke gift, it has a timer on it so it would shock me awake in the middle of night. The women was gone and My screams woke up my dogs so i went down stairs to let them out. However while, walking i noticed my foot hurt like i had recently kicked something, and most worryingly of all.\n\nI didn't remember opening my door to leave my room."], ["how can you tell when someone has bad intentions?", "twisting a wiry mustache or rubbing hands together"], ["what piece of literature commonly referenced as a \"classic\", actually isn't good at all?", "On the Road. Self-indulgent and rambling."], ["what’s the weirdest thought you’ve ever had?", "What if the color blue is actually a smell, and we're just not evolved enough to detect it?"], ["when you die you are able to go anywhere in any era as a spectator, where are you going?", "I would go to pre historic areas untouched by man"], ["what should a teacher do when the latino kid keeps speaking spanish to prevent them from understanding?", "Threaten the chancla."], ["what is the single-most shocking thing someone has said to you in an online game?", "There is a hilarious online clip where a teen boy of some age admits that the father had raped his older sister and then followed up with \"She's ugly as shit though; i don't even know why he would hit that.\""], ["what's the weirdest thing you have ever googled?", "What's the longest recorded fart?"], ["if you could live in anybody else’s body for a day, who’s body would it be and why?", "i’d live in my husbands body for a day. i’d schedule an emergency same day surgery to get my cheating dick removed."], ["whats something that brings you comfort on a hard day?", "\n\nI watch Harry Potter. Honestly, it’s my movie equivalent of comfort food."], ["what is humanity’s greatest accomplishment?", "Increasing the quality of life that allows for explosive population growth.\n\nOther than that, putting a person on the moon which is beginning to look more and more like primitive technology."], ["what is that opinion of yours that is like: \"i will die in that hill\"?", "Properly use sayings… on a hill, not in a hill"], ["if you could instantly master one skill, what would it be and why?", "Speaking, writing and understanding multiple languages."], ["what is the best suncream to use on your face?", "It depends if you have oily, dry or combo skin. I’ve found that Japanese or Korean sunscreens are much more cosmetically elegant than European ones. For oily skin I would recommend haruharu airy fit - no white cast either."], ["if you were a vehicle, what kind of vehicle would you be?", "72 Ford Pinto Runabout."], ["what's the best way to make fried chicken?", "Don't go deep. Do shallow frying in cast iron pan. The crust is super flavorful. "], ["if you were to move out of the united states, where would be the best country in the world to live in both the northern and southern hemispheres and why?", "Canada and New Zeland"], ["how would you emotionally support a confidant who tried to take their own life last night?", "Just be there. Listen. Don't judge. Encourage them to get help. That's all you can do."], ["how do you feel about the current state of trade?", "Every generation thinks their predicaments sucks and things were lot better back in the day yet oxymoronically every generation things that it is the smartest generation on the cinder.\n\nSame shit, different era."], ["what is your personality flex?", "Don’t be afraid to brag about yourself!"], ["men, what names do you love being called by your female partner?", "she calls me Bärchen which is the german word for \"little bear\". im not german but she is, and trust me when i say it makes me melt every single time"], ["what's a quote that you try and live by each day?", "\"Be excellent to each other...\""], ["what's the most bizarre encounter you had with a stranger?", "When I was a kid, a stranger at the gas station walked up to our car while my dad was in the store paying. Our windows were down, and he said my brother's name, and when he got his attention said \"I'm you from the future.\" Then he just turned around, got into his Blue porche & drove away. I used to really believe in time travel because of this."], ["what was a fact that they taught us in school and then later it was proven wrong?", "The food guide pyramid"], ["what thought comes to your mind when you close your eyes at night?", "Suicide. Every single time, not as a result of wanting to die, but it’s always there"], ["what are some mysteries that have never been solved?", "Wiki unsolved mysteries (not the show) there’s a huge list. Lots of fun to read."], ["what is the best movie of your life?", "The adventures of picasso."], ["what injury would you never want to have?", "Face ruined by acid thrown at me. Potential for blindness or deafness, ruined face, the immense pain it causes."], ["what did you go to school for vs the job you actually got ?", "Got my Bachelors in Mathematics. Used it to get work in data processing and forecasting. And I tutor as well."], ["what is a website everyone should know about?", "[https://remove.bg](https://remove.bg)\n\nremoves image backgrounds for free, quickly."], ["what's something you're proud of accomplishing this year?", "expanding my ideas of the world and becoming more mature."], ["what's the logic behind americans leaving car keys in the sun vigor?", "Seems like some 1980s movies logic. Or Florida and Arizona rationalisms."], ["whats a book that changed your perspective on your life?", "Hitchhikers Guide to the Galaxy. Sometimes you have to embrace the chaos as long as you know where your towel (re: important stuff) is."], ["what's an active subreddit you use to go to regularly but you can't bring yourself to go anymore?", "r/pics\n\nNot only because of the obnoxious amount of political posts nowadays, but also because I got banned for a post that followed all the listed rules of the sub. I still don't know why."], ["what's one thing you should try atleast once in your life?", "Breathing. I hear it's very popular."], ["what video game tested the absolute limits of your patience?", "Bloodborne.\n\nI died 93 times in the starting areas. 117 times to the 1st boss.\n\nAnd I'm now on 1743 deaths"]]